funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
uint32_t FreqMeasure_read(void) {
	uint8_t head, tail;
	uint32_t value;

	head = buffer_head;
	tail = buffer_tail;
	if (head == tail)
		return 0xFFFFFFFF;
	tail = tail + 1;
	if (tail >= FREQMEASURE_BUFFER_LEN)
		tail = 0;
	value = buffer_value[tail];
	buffer_tail = tail;
	return value;
}

void FreqMeasure_end(void) {
	capture_shutdown();
}

ISR(TIMER_OVERFLOW_VECTOR) {
	capture_msw++;
}

ISR(TIMER_CAPTURE_VECTOR) {
	uint16_t capture_lsw;
	uint32_t capture, period;
	uint8_t i;

	// get the timer capture
	capture_lsw = capture_read();
	// Handle the case where but capture and overflow interrupts were pending
	// (eg, interrupts were disabled for a while), or where the overflow occurred
	// while this ISR was starting up.  However, if we read a 16 bit number that
	// is very close to overflow, then ignore any overflow since it probably
	// just happened.
	if (capture_overflow() && capture_lsw < 0xFF00) {
		capture_overflow_reset();
		capture_msw++;
	}
	// compute the waveform period
	capture = ((uint32_t) capture_msw << 16) | capture_lsw;
	period = capture - capture_previous;
	capture_previous = capture;
	// store it into the buffer
	i = buffer_head + 1;
	if (i >= FREQMEASURE_BUFFER_LEN)
		i = 0;
	if (i != buffer_tail) {
		buffer_value[i] = period;
		buffer_head = i;
	}
}
#endif //ENABLE_FREQMEASURE
//--
#ifdef ENABLE_CONVERSION
uint8_t bcd2bin(uint8_t bcd) {
#ifdef OPTIMIZE_SPEED
	return (10 * (bcd >> 4) | (bcd & 0x0f));
#else
	uint8_t Temp = bcd & 0x0F;
	while (bcd >= 0x10) {
		Temp += 10;
		bcd -= 0x10;
	}
	return Temp;
#endif
}

uint8_t bin2bcd(uint8_t bin) {
#ifdef OPTIMIZE_SPEED
	return (((bin / 10) << 4) | (bin % 10));
#else
	uint8_t Temp = 0;
	while (bin > 9) {
		Temp += 0x10;
		bin -= 10;
	}
	return Temp + bin;
#endif
}

uint8_t nibble2hex(uint8_t val) {
	uint8_t s;
	s = '0' + (val & 0xf);
	if (s > '9')
		s += 'A' - '9' - 1;
	return s;
}

void byte2dec(uint8_t val, int8_t *s) {
	if (val > 99) {
		s[2] = '0' + (val % 10);
		val /= 10;
		s[1] = '0' + (val % 10);
		val /= 10;
		s[0] = '0' + val;
		//
		s[3] = 0;
	} else if (val > 9) {
		s[1] = '0' + (val % 10);
		val /= 10;
		s[0] = '0' + val;
		s[2] = 0;
		//
		//s[3] = 0;
	} else {
		s[0] = '0' + val;
		//s[2] = 0;
		s[1] = 0;
		//
		///s[3] = 0;
	}
}

void double2hex(uint32_t val, int8_t *s) {
	s[0] = nibble2hex(val >> 28);
	s[1] = nibble2hex(val >> 24);
	s[2] = nibble2hex(val >> 20);
	s[3] = nibble2hex(val >> 16);
	s[4] = nibble2hex(val >> 12);
	s[5] = nibble2hex(val >> 8);
	s[6] = nibble2hex(val >> 4);
	s[7] = nibble2hex(val);
	s[8] = 0;
}

void word2hex(uint16_t val, int8_t *s) {
	s[0] = nibble2hex(val >> 12);
	s[1] = nibble2hex(val >> 8);
	s[2] = nibble2hex(val >> 4);
	s[3] = nibble2hex(val);
	s[4] = 0;
}

void byte2hex(uint8_t val, int8_t *s) {
	s[0] = nibble2hex(val >> 4);
	s[1] = nibble2hex(val);
	s[2] = 0;
}
#endif // end conversion
//--
//Interrupt based.
#ifdef ENABLE_SERIAL

//
uint8_t uart_buffer[UART_BUFFER_SIZE];
volatile uint8_t uart_readptr;
volatile uint8_t uart_writeptr;

ISR(UART0_ISR_VECT)// see the header file...
{
	uart_buffer[uart_writeptr] = UART0_DATA;
	uart_writeptr = (uart_writeptr + 1) % UART_BUFFER_SIZE;
}

void serial_init(void) {
	uart_writeptr = 0;
	uart_readptr = 0;

	// set default baud rate
#if defined(USART_RXC_vect) // for ATmega16A
	UBRRH = UART_BAUD_SELECT >> 8;
	UBRRL = UART_BAUD_SELECT;

	// enable receive, transmit and enable receive interrupts
	UCSRB = (1 << RXEN) | (1 << TXEN) | (1 << RXCIE);

	// don't forget sei()
#else
	UBRR0H = UART_BAUD_SELECT >> 8;
	UBRR0L = UART_BAUD_SELECT;

	// enable receive, transmit and enable receive interrupts
	UCSR0B = (1 << RXEN0) | (1 << TXEN0) | (1 << RXCIE0);

	// don't forget sei()
#endif
}

uint8_t serial_getchar(void) {
	uint8_t c;

	//Non-blocking function - but serial_available() MUST be used!!!
	c = uart_buffer[uart_readptr];
	uart_readptr = (uart_readptr + 1) % UART_BUFFER_SIZE;
	return c;
}

uint8_t serial_available(void) {
	if (uart_writeptr != uart_readptr)
	return TRUE;
	else
	return FALSE;
}

void serial_flush(void) { // sort of...
	// only reinitializing the "pointers"
	uart_writeptr = 0;
	uart_readptr = 0;
}

#endif // end serial with interrupt
#ifdef ENABLE_SERIAL_POLL
/* Initialize UART */
void serial_init(void) {
	/* Set the baud rate */
	UBRR0H = (uint8_t) (UART_BAUD_SELECT >> 8);
	UBRR0L = (uint8_t) UART_BAUD_SELECT;
	/* Enable UART receiver and transmitter */UCSR0B = ((1 << RXEN0)
			| (1 << TXEN0));
	/* Set frame format: 8 data 2stop */
	UCSR0C = (1 << USBS0) | (1 << UCSZ01) | (1 << UCSZ00); //For devices with Extended IO
	//UCSR0C = (1<<URSEL)|(1<<USBS0)|(1<<UCSZ01)|(1<<UCSZ00);   //For devices without Extended IO
}

/* Read and write functions */
uint8_t serial_getchar(void) {
	/* Wait for incoming data */
	while (!(UCSR0A & (1 << RXC0)))
		;
	/* Return the data */
	return UDR0;
}
#endif // END SERIAL_POLL
//
#if defined(ENABLE_SERIAL) || defined(ENABLE_SERIAL_POLL)
void serial_putchar(uint8_t data) {
	/* Wait for empty transmit buffer */
#if defined(USART_RXC_vect)
	while (!(UCSRA & (1 << UDRE)))
		;
	/* Start transmission */
	UDR = data;
#else
	while (!(UCSR0A & (1 << UDRE0)))
		;
	/* Start transmission */
	UDR0 = data;
#endif
}

void serial_putstr(int8_t * s) {
	register uint8_t c;
	while ((c = *s++))
		serial_putchar(c);
}

// Example:
//  uint8_t const pgm_str1[] PROGMEM =  "!Smiley!\0";
//  uint8_t const pgm_str2[] PROGMEM =  "!Micros!\0";
//  serial_putstr_f((int8_t *)pgm_str1);
//  serial_putstr_f((int8_t *)pgm_str2);
void serial_putstr_f(int8_t *s) {
	register uint8_t c;
	while ((c = pgm_read_byte(s++)))
		serial_putchar(c);
}

// NOT working ...
//void serial_putstr_e(uint8_t *s)
//  {
//	  register uint8_t c;
//	  while ((c = eeprom_read_byte(s++)))
//		  serial_putchar(c);
//  }

void serial_putint(int value) {
	int8_t string[18];
	itoa(value, (char *) string, 10);
	serial_putstr(string);
}

void serial_putU08(uint8_t value) {
	int8_t s[4];
	byte2dec(value, s);
	serial_putstr(s);
}

void serial_puthexU08(uint8_t value) {
	int8_t s[3];
	byte2hex(value, s);
	serial_putstr(s);
}

void serial_puthexU16(uint16_t value) {
	int8_t s[5];
	word2hex(value, s);
	serial_putstr(s);
}

void serial_puthexU32(uint32_t value) {
	int8_t s[9];
	double2hex(value, s);
	serial_putstr(s);
}

#endif

#ifdef ENABLE_SPI

#ifdef ENABLE_SPI_INT

