funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
ISR(SPI_STC_vect) {
	SPI_TC = TRUE;
}
#endif

void SPI_master_init(void) {
	// Set SS to high so a connected chip will be "deselected" by default
	sbi(SS_PORT, SS);

	// When the SS pin is set as OUTPUT, it can be used as
	// a general purpose output port (it doesn't influence
	// SPI operations).
	sbi(SS_DDR, SS);

#ifdef ENABLE_SPI_INT
	SPI_TC = FALSE;
#endif
	// Warning: if the SS pin ever becomes a LOW INPUT then SPI
	// automatically switches to Slave, so the data direction of
	// the SS pin MUST be kept as OUTPUT.
	SPCR |= _BV(MSTR);
	SPCR |= _BV(SPE);

	// Set direction register for SCK and MOSI pin.
	// MISO pin automatically overrides to INPUT.
	// By doing this AFTER enabling SPI, we avoid accidentally
	// clocking in a single bit since the lines go directly
	// from "input" to SPI control.
	// http://code.google.com/p/arduino/issues/detail?id=888
	sbi(SCK_DDR, SCK);
	sbi(MOSI_DDR, MOSI);
}

void SPI_master_setBitOrder(uint8_t bitOrder) {
	if (bitOrder == LSBFIRST) {
		SPCR |= _BV(DORD);
	} else {
		SPCR &= ~(_BV(DORD));
	}
}

void SPI_master_setDataMode(uint8_t mode) {
	SPCR = (SPCR & ~SPI_MODE_MASK) | mode;
}

void SPI_master_setClockDivider(uint8_t rate) {
	SPCR = (SPCR & ~SPI_CLOCK_MASK) | (rate & SPI_CLOCK_MASK);
	SPSR = (SPSR & ~SPI_2XCLOCK_MASK) | ((rate >> 2) & SPI_2XCLOCK_MASK);
}

void SPI_attachInterrupt(void) {
	SPCR |= _BV(SPIE);
}

void SPI_detachInterrupt(void) {
	SPCR &= ~_BV(SPIE);
}

void SPI_master_stop(void) {
	SPCR &= ~_BV(SPE);
}

uint8_t SPI_master_transmit(uint8_t data) {
	uint8_t reply;
	// Start transmission
	SPDR = data;
	// Wait for transmission complete
#ifdef ENABLE_SPI_INT
	while(!SPI_TC)
	;
#else
	while (!(SPSR & (1 << SPIF)))
	;
#endif
#ifdef ENABLE_SPI_INT
	SPI_TC = FALSE;
#endif
	reply = SPDR;
	return reply;
}

uint8_t SPI_master_receive(void) {
	uint8_t data;
	// Start reception
	SPDR = 0xFF;
	// Wait for transmission complete
#ifdef ENABLE_SPI_INT
	while(!SPI_TC)
	;
#else
	while (!(SPSR & (1 << SPIF)))
	;
#endif
#ifdef ENABLE_SPI_INT
	SPI_TC = FALSE;
#endif
	data = SPDR;
	return data;
}

//the following function is required by (Arduino/ATmega)ISP programmer

uint8_t SPI_master_transaction(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
	uint8_t n;
	//int8_t error;
	//n = 0;
	SPI_master_transmit(a);
	n = SPI_master_transmit(b);
	//if (n != a) error = -1;
	n = SPI_master_transmit(c);
	return SPI_master_transmit(d);
}

#endif // ENABLE_SPI
#ifdef ENABLE_SD_CARD

//******************************************************************
//Function	: to initialize the SD/SDHC card in SPI mode
//Arguments	: none
//return	: unsigned char; will be 0 if no error,
// 			  otherwise the response byte will be sent
//******************************************************************
uint8_t SD_init(void) {
	uint8_t i, response, SD_version;
	uint16_t retry = 0;

	//set the direction of the CS pin
	sbi(SD_CS_DDR, SD_CS_PIN);
	//output
	SD_cardType = 0;
	for (i = 0; i < 10; i++)
	SPI_master_transmit(0xff);//80 clock pulses spent before sending the first command
	SD_CS_ASSERT;
	do {

		response = SD_sendCommand(GO_IDLE_STATE, 0); //send 'reset & go idle' command
		retry++;
		if (retry > 0x20)
		return 1;//time out, card not detected

	}while (response != 0x01);

	SD_CS_DEASSERT;
	SPI_master_transmit(0xff);
	SPI_master_transmit(0xff);

	retry = 0;

	SD_version = 2; //default set to SD compliance with ver2.x;
					//this may change after checking the next command
	do {
		response = SD_sendCommand(SEND_IF_COND, 0x000001AA); //Check power supply status, mandatory for SDHC card
		retry++;
		if (retry > 0xfe) {
			//TX_NEWLINE;
			SD_version = 1;
			SD_cardType = 1;
			break;
		} //time out

	}while (response != 0x01);

	retry = 0;

	do {
		response = SD_sendCommand(APP_CMD, 0); //CMD55, must be sent before sending any ACMD command
		response = SD_sendCommand(SD_SEND_OP_COND, 0x40000000);//ACMD41

		retry++;
		if (retry > 0xfe) {
			//TX_NEWLINE;
			return 2;//time out, card initialization failed
		}

	}while (response != 0x00);

	retry = 0;
	SDHC_flag = 0;

	if (SD_version == 2) {
		do {
			response = SD_sendCommand(READ_OCR, 0);
			retry++;
			if (retry > 0xfe) {
				//TX_NEWLINE;
				SD_cardType = 0;
				break;
			} //time out

		}while (response != 0x00);

		if (SDHC_flag == 1)
		SD_cardType = 2;
		else
		SD_cardType = 3;
	}

	//SD_sendCommand(CRC_ON_OFF, OFF); //disable CRC; default - CRC disabled in SPI mode
	//SD_sendCommand(SET_BLOCK_LEN, 512); //set block size to 512; default size is 512

	return 0;//successful return
} // end SD_init

// Call this after SD_init()
uint8_t SD_card_type(void) { //because now SD_cardType is not public...
	return SD_cardType;
}

//******************************************************************
//Function	: to send a command to SD card
//Arguments	: unsigned char (8-bit command value)
// 			  & unsigned long (32-bit command argument)
//return	: unsigned char; response byte
//******************************************************************
uint8_t SD_sendCommand(uint8_t cmd, uint32_t arg) {
	uint8_t response, retry = 0, status;

	//SD card accepts byte address while SDHC accepts block address in multiples of 512
	//so, if it's SD card we need to convert block address into corresponding byte address by
	//multiplying it with 512. which is equivalent to shifting it left 9 times
	//following 'if' loop does that

	if (SDHC_flag == 0)
	if (cmd == READ_SINGLE_BLOCK || cmd == READ_MULTIPLE_BLOCKS
			|| cmd == WRITE_SINGLE_BLOCK || cmd == WRITE_MULTIPLE_BLOCKS
			|| cmd == ERASE_BLOCK_START_ADDR || cmd == ERASE_BLOCK_END_ADDR) {
		arg = arg << 9;
	}

	SD_CS_ASSERT;

	SPI_master_transmit(cmd | 0x40); //send command, first two bits always '01'
	SPI_master_transmit(arg >> 24);
	SPI_master_transmit(arg >> 16);
	SPI_master_transmit(arg >> 8);
	SPI_master_transmit(arg);

	if (cmd == SEND_IF_COND)//it is compulsory to send correct CRC for CMD8 (CRC=0x87) & CMD0 (CRC=0x95)
	SPI_master_transmit(0x87);//for remaining commands, CRC is ignored in SPI mode
	else
	SPI_master_transmit(0x95);

