funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
	while ((response = SPI_master_receive()) == 0xff)//wait response
	if (retry++ > 0xfe)
	break;//time out error

	if (response == 0x00 && cmd == 58)//checking response of CMD58
	{
		status = SPI_master_receive() & 0x40; //first byte of the OCR register (bit 31:24)
		if (status == 0x40)
		SDHC_flag = 1;//we need it to verify SDHC card
		else
		SDHC_flag = 0;

		SPI_master_receive();//remaining 3 bytes of the OCR register are ignored here
		SPI_master_receive();//one can use these bytes to check power supply limits of SD
		SPI_master_receive();
	}

	SPI_master_receive(); //extra 8 CLK
	SD_CS_DEASSERT;

	return response;//return state
} // end SD_sendCommand

//*****************************************************************
//Function	: to erase specified no. of blocks of SD card
//Arguments	: none
//return	: unsigned char; will be 0 if no error,
// 			  otherwise the response byte will be sent
//*****************************************************************
uint8_t SD_erase(uint32_t SD_startBlock, uint32_t SD_totalBlocks) {
	uint8_t response;

	response = SD_sendCommand(ERASE_BLOCK_START_ADDR, SD_startBlock); //send starting block address
	if (response != 0x00)//check for SD status: 0x00 - OK (No flags set)
	return response;

	response = SD_sendCommand(ERASE_BLOCK_END_ADDR,
			(SD_startBlock + SD_totalBlocks - 1));//send end block address
	if (response != 0x00)
	return response;

	response = SD_sendCommand(ERASE_SELECTED_BLOCKS, 0);//erase all selected blocks
	if (response != 0x00)
	return response;

	return 0;//normal return
} // end SD_erase

//******************************************************************
//Function	: to read a single block from SD card
//Arguments	: none
//return	: unsigned char; will be 0 if no error,
// 			  otherwise the response byte will be sent
//******************************************************************
uint8_t SD_readSingleBlock(uint32_t SD_startBlock) {
	uint8_t response;
	uint16_t i, retry = 0;

	response = SD_sendCommand(READ_SINGLE_BLOCK, SD_startBlock); //read a Block command

	if (response != 0x00)
	return response;//check for SD status: 0x00 - OK (No flags set)

	SD_CS_ASSERT;

	retry = 0;
	while (SPI_master_receive() != 0xfe)//wait for start block token 0xfe (0x11111110)
	if (retry++ > 0xfffe) {
		SD_CS_DEASSERT;
		return 1;
	} //return if time-out

	for (i = 0; i < 512; i++)//read 512 bytes
	SD_buffer[i] = SPI_master_receive();

	SPI_master_receive();//receive incoming CRC (16-bit), CRC is ignored here
	SPI_master_receive();

	SPI_master_receive();//extra 8 clock pulses
	SD_CS_DEASSERT;

	return 0;
}

//******************************************************************
//Function	: to write to a single block of SD card
//Arguments	: none
//return	: unsigned char; will be 0 if no error,
// 			  otherwise the response byte will be sent
//******************************************************************
uint8_t SD_writeSingleBlock(uint32_t SD_startBlock) {
	uint8_t response;
	uint16_t i, retry = 0;

	response = SD_sendCommand(WRITE_SINGLE_BLOCK, SD_startBlock); //write a Block command

	if (response != 0x00)
	return response;//check for SD status: 0x00 - OK (No flags set)
	SD_CS_ASSERT;

	SPI_master_transmit(0xfe);//Send start block token 0xfe (0x11111110)

	for (i = 0; i < 512; i++)//send 512 bytes data
	SPI_master_transmit(SD_buffer[i]);

	SPI_master_transmit(0xff);//transmit dummy CRC (16-bit), CRC is ignored here
	SPI_master_transmit(0xff);

	response = SPI_master_receive();

	if ((response & 0x1f) != 0x05)//response= 0xXXX0AAA1 ; AAA='010' - data accepted
	{ //AAA='101'-data rejected due to CRC error
		SD_CS_DEASSERT;//AAA='110'-data rejected due to write error
		return response;
	}

	while (!SPI_master_receive()) //wait for SD card to complete writing and get idle
	if (retry++ > 0xfffe) {
		SD_CS_DEASSERT;
		return 1;
	}

	SD_CS_DEASSERT;
	SPI_master_transmit(0xff); //just spend 8 clock cycle delay before re asserting the CS line
	SD_CS_ASSERT;//re-asserting the CS line to verify if card is still busy

	while (!SPI_master_receive())//wait for SD card to complete writing and get idle
	if (retry++ > 0xfffe) {
		SD_CS_DEASSERT;
		return 1;
	}
	SD_CS_DEASSERT;

	return 0;
}
#endif // ENABLE_SD_CARD
// TODO: define FAT32 error codes!
#ifdef ENABLE_FAT32

// TODO: to be rewritten... depends on PCF8583 RTC functions...
uint8_t getDateTime_FAT(void) {
#ifdef ENABLE_PCF8583
	//it should get the time from RTC but for now, returns "error" code
	return 1;
#else
	return 1; // returning "error" code if RTC not available
			  // date and time are 0 - good enough for testing and budget
#endif
}

//***************************************************************************
//Function: to read data from boot sector of SD card, to determine important
//parameters like bytesPerSector, sectorsPerCluster etc.
//Arguments: none
//return: none
//***************************************************************************
uint8_t F32_getBootSectorData(void) {
	struct BS_Structure *bpb; //mapping the buffer onto the structure
	struct MBRinfo_Structure *mbr;
	struct partitionInfo_Structure *partition;
	uint32_t dataSectors;

	unusedSectors = 0;

	SD_readSingleBlock(0);
	bpb = (struct BS_Structure *) SD_buffer;

	if (bpb->jumpBoot[0] != 0xE9 && bpb->jumpBoot[0] != 0xEB)//check if it is boot sector
	{
		mbr = (struct MBRinfo_Structure *) SD_buffer; //if it is not boot sector, it must be MBR

		if (mbr->signature != 0xaa55)
		return 1;//if it is not even MBR then it's not FAT32

		partition = (struct partitionInfo_Structure *) (mbr->partitionData);//first partition
		unusedSectors = partition->firstSector;//the unused sectors, hidden to the FAT

		SD_readSingleBlock(partition->firstSector);//read the bpb sector
		bpb = (struct BS_Structure *) SD_buffer;
		if (bpb->jumpBoot[0] != 0xE9 && bpb->jumpBoot[0] != 0xEB)
		return 1;
	}

	bytesPerSector = bpb->bytesPerSector;
#ifdef ENABLE_SD_CARD_DEBUG
	//serial_puthexU16(bytesPerSector); serial_putchar(' ');
#endif
	sectorPerCluster = bpb->sectorPerCluster;
#ifdef ENABLE_SD_CARD_DEBUG
	//serial_puthexU08(sectorPerCluster); serial_putchar(' ');
#endif
	reservedSectorCount = bpb->reservedSectorCount;
	rootCluster = bpb->rootCluster; // + (sector / sectorPerCluster) +1;
	firstDataSector = bpb->hiddenSectors + reservedSectorCount
	+ (bpb->numberofFATs * bpb->FATsize_F32);

	dataSectors = bpb->totalSectors_F32 - bpb->reservedSectorCount
	- (bpb->numberofFATs * bpb->FATsize_F32);
	totalClusters = dataSectors / sectorPerCluster;
#ifdef ENABLE_SD_CARD_DEBUG
	//serial_puthexU32(totalClusters); serial_putchar(' ');
#endif
	if ((F32_getSetFreeCluster(TOTAL_FREE, GET, 0)) > totalClusters) //check if FSinfo free clusters count is valid
	freeClusterCountUpdated = 0;
	else
	freeClusterCountUpdated = 1;
	return 0;
}

//***************************************************************************
//Function: to calculate first sector address of any given cluster
//Arguments: cluster number for which first sector is to be found
//return: first sector address
//***************************************************************************
uint32_t F32_getFirstSector(uint32_t clusterNumber) {
	return (((clusterNumber - 2) * sectorPerCluster) + firstDataSector);
}

//***************************************************************************
//Function: get cluster entry value from FAT to find out the next cluster in the chain
//or set new cluster entry in FAT
//Arguments: 1. current cluster number, 2. get_set (=GET, if next cluster is to be found or = SET,
//if next cluster is to be set 3. next cluster number, if argument#2 = SET, else 0
//return: next cluster number, if if argument#2 = GET, else 0
//****************************************************************************
uint32_t F32_getSetNextCluster(uint32_t clusterNumber, uint8_t get_set,
		uint32_t clusterEntry) {
	uint16_t FATEntryOffset;
	uint32_t *FATEntryValue;
	uint32_t FATEntrySector;
	uint8_t retry = 0;

//get sector number of the cluster entry in the FAT
	FATEntrySector = unusedSectors + reservedSectorCount
	+ ((clusterNumber * 4) / bytesPerSector);

//get the offset address in that sector number
	FATEntryOffset = (uint16_t) ((clusterNumber * 4) % bytesPerSector);

//read the sector into a buffer
	while (retry < 10) {
		if (!SD_readSingleBlock(FATEntrySector))
		break;
		retry++;
	}

//get the cluster address from the buffer
	FATEntryValue = (uint32_t *) &SD_buffer[FATEntryOffset];

	if (get_set == GET)
	return ((*FATEntryValue) & 0x0fffffff);

	*FATEntryValue = clusterEntry;//for setting new value in cluster entry in FAT

	SD_writeSingleBlock(FATEntrySector);

	return (0);
}

//********************************************************************************************
//Function: to get or set next free cluster or total free clusters in FSinfo sector of SD card
//Arguments: 1.flag:TOTAL_FREE or NEXT_FREE,
//       2.flag: GET or SET
//       3.new FS entry, when argument2 is SET; or 0, when argument2 is GET
//return: next free cluster, if arg1 is NEXT_FREE & arg2 is GET
//        total number of free clusters, if arg1 is TOTAL_FREE & arg2 is GET
//      0xffffffff, if any error or if arg2 is SET
//********************************************************************************************
uint32_t F32_getSetFreeCluster(uint8_t totOrNext, uint8_t get_set,
		uint32_t FSEntry) {

	struct FSInfo_Structure *FS = (struct FSInfo_Structure *) &SD_buffer;

	SD_readSingleBlock(unusedSectors + 1);

	if ((FS->leadSignature != 0x41615252)
			|| (FS->structureSignature != 0x61417272)
			|| (FS->trailSignature != 0xaa550000))
	return 0xffffffff;

	if (get_set == GET) {
		if (totOrNext == TOTAL_FREE)
		return (FS->freeClusterCount);
		else
		// when totOrNext = NEXT_FREE
		return (FS->nextFreeCluster);
	} else {
		if (totOrNext == TOTAL_FREE)
		FS->freeClusterCount = FSEntry;
		else
		// when totOrNext = NEXT_FREE
		FS->nextFreeCluster = FSEntry;

		SD_writeSingleBlock(unusedSectors + 1);//update FSinfo
	}
	return 0xffffffff;
}

//***************************************************************************
//Function: to get DIR/FILE list or a single file address (cluster number) or to delete a specified file
//Arguments: #1 - flag: GET_LIST, GET_FILE or DELETE #2 - pointer to file name (0 if arg#1 is GET_LIST)
//return: first cluster of the file, if flag = GET_FILE
//        print file/dir list of the root directory, if flag = GET_LIST
//      Delete the file mentioned in arg#2, if flag = DELETE
//****************************************************************************
struct dir_Structure* F32_findFiles(uint8_t flag, uint8_t *fileName) {
	uint32_t cluster, sector, firstSector, firstCluster, nextCluster;
	struct dir_Structure *dir;
	uint16_t i;
	uint8_t j;

	cluster = rootCluster; //root cluster

	while (1) {
		firstSector = F32_getFirstSector(cluster);

