funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
		for (sector = 0; sector < sectorPerCluster; sector++) {
			SD_readSingleBlock(firstSector + sector);

			for (i = 0; i < bytesPerSector; i += 32) {
				dir = (struct dir_Structure *) &SD_buffer[i];

				if (dir->name[0] == EMPTY) //indicates end of the file list of the directory
				{
#ifdef ENABLE_SD_CARD_DEBUG
					if (flag == DELETE)
					serial_puts_f("\r\nFile does not exist!");
#endif
					return 0;
				}
				if ((dir->name[0] != DELETED)
						&& (dir->attrib != ATTR_LONG_NAME)) {
					if ((flag == GET_FILE) || (flag == DELETE)) {
						for (j = 0; j < 11; j++)
						if (dir->name[j] != fileName[j])
						break;
						if (j == 11) {
							if (flag == GET_FILE) {
								appendFileSector = firstSector + sector;
								appendFileLocation = i;
								appendStartCluster =
								(((uint32_t) dir->firstClusterHI) << 16)
								| dir->firstClusterLO;
								fileSize = dir->fileSize;
								return (dir);
							} else //when flag = DELETE
							{
#ifdef ENABLE_SD_CARD_DEBUG
								//TX_NEWLINE;
								serial_puts_f("\r\nDeleting..");
								//TX_NEWLINE;
								//TX_NEWLINE;
#endif
								firstCluster = (((uint32_t) dir->firstClusterHI)
										<< 16) | dir->firstClusterLO;

								//mark file as 'deleted' in FAT table
								dir->name[0] = DELETED;
								SD_writeSingleBlock(firstSector + sector);

								F32_freeMemoryUpdate(ADD, dir->fileSize);

								//update next free cluster entry in FSinfo sector
								cluster = F32_getSetFreeCluster(NEXT_FREE, GET,
										0);
								if (firstCluster < cluster)
								F32_getSetFreeCluster(NEXT_FREE, SET,
										firstCluster);

								//mark all the clusters allocated to the file as 'free'
								while (1) {
									nextCluster = F32_getSetNextCluster(
											firstCluster, GET, 0);
									F32_getSetNextCluster(firstCluster, SET, 0);
									if (nextCluster > 0x0ffffff6) {
#ifdef ENABLE_SD_CARD_DEBUG
										serial_puts_f("\r\nFile deleted!");
#endif
										return 0;
									}
									firstCluster = nextCluster;
								}
							}
						}
					} else //when flag = GET_LIST
					{
#ifdef ENABLE_SD_CARD_DEBUG
						TX_NEWLINE;
#endif
						for (j = 0; j < 11; j++) {
#ifdef ENABLE_SD_CARD_DEBUG
							if (j == 8)
							serial_putc(' ');
							serial_putc(dir->name[j]);
#endif
						}
#ifdef ENABLE_SD_CARD_DEBUG
						serial_puts("   ");
#endif
						if ((dir->attrib != 0x10) && (dir->attrib != 0x08)) {
#ifdef ENABLE_SD_CARD_DEBUG
							serial_puts_f("FILE");
							serial_puts_f("   ");
#endif
							F32_displayMemory(LOW, dir->fileSize);
						} else {
#ifdef ENABLE_SD_CARD_DEBUG
							serial_putstr(
									(dir->attrib == 0x10) ? (int8_t *)"DIR\0" : (int8_t *)"ROOT\0");
#endif
						}
					}
				}
			}
		}

		cluster = (F32_getSetNextCluster(cluster, GET, 0));

		if (cluster > 0x0ffffff6)
		return 0;
		if (cluster == 0) {
#ifdef ENABLE_SD_CARD_DEBUG
			serial_puts_f("\r\nError in getting cluster");
#endif
			return 0;
		}
	}
	return 0;
}

//***************************************************************************
//Function: if flag=READ then to read file from SD card and send contents to UART
//if flag=VERIFY then functions will verify whether a specified file is already existing
//Arguments: flag (READ or VERIFY) and pointer to the file name
//return: 0, if normal operation or flag is READ
//        1, if file is already existing and flag = VERIFY; or if flag=READ and file does not exist
//      2, if file name is incompatible
//***************************************************************************
uint8_t F32_readFile(uint8_t flag, uint8_t *fileName) {
	struct dir_Structure *dir;
	uint32_t cluster, byteCounter = 0, fileSize, firstSector;
	uint16_t k;
	uint8_t j, error;

	//error = F32_convertFileName(fileName); //convert fileName into FAT format
	//if (error)
	//	return 2;

	dir = F32_findFiles(GET_FILE, fileName);//get the file location
	if (dir == 0) {
		if (flag == READ)
		return (1);
		else
		return (0);
	}

	if (flag == VERIFY)
	return (1); //specified file name is already existing

	cluster = (((uint32_t) dir->firstClusterHI) << 16) | dir->firstClusterLO;

	fileSize = dir->fileSize;
#ifdef ENABLE_SD_CARD_DEBUG
	//TX_NEWLINE;
	//TX_NEWLINE;
#endif
	while (1) {
		firstSector = F32_getFirstSector(cluster);

		for (j = 0; j < sectorPerCluster; j++) {
			SD_readSingleBlock(firstSector + j);

			for (k = 0; k < 512; k++) {
#ifdef ENABLE_SD_CARD_DEBUG
				serial_putc(SD_buffer[k]);
#endif
				if ((byteCounter++) >= fileSize)
				return 0;
			}
		}
		cluster = F32_getSetNextCluster(cluster, GET, 0);
		if (cluster == 0) {
#ifdef ENABLE_SD_CARD_DEBUG
			serial_puts_f("\r\nError in getting cluster");
#endif
			return 0;
		}
	}
	return 0;
}

//***************************************************************************
//Function: to convert normal short file name into FAT format
//Arguments: pointer to the file name
//return: 0, if successful else 1.
//***************************************************************************
/*uint8_t F32_convertFileName(uint8_t *fileName) {
 uint8_t fileNameFAT[11];
 uint8_t i, j, k;


 //i = 0;
 //for (j = 0; j < 12; j++){
 //	if (fileName[j] != '.') {
 //		fileNameFAT[i] = fileName[j];
 //		i = i + 1;
 //	}

 //}

 for (j = 0; j < 12; j++)
 if (fileName[j] == '.')
 break;

 if (j > 8) {
 #ifdef ENABLE_SD_CARD_DEBUG
 serial_putstr_f((const int8_t *)"\r\nInvalid fileName..\0");
 #endif
 return 1;

 }

 for (k = 0; k < j; k++) //setting file name
 fileNameFAT[k] = fileName[k];

 for (k = j; k <= 7; k++) //filling file name trail with blanks
 fileNameFAT[k] = ' ';

 j++;
 for (k = 8; k < 11; k++) //setting file extension
 {
 if (fileName[j] != 0)
 fileNameFAT[k] = fileName[j++];
 else
 //filling extension trail with blanks
 while (k < 11)
 fileNameFAT[k++] = ' ';
 }

 for (j = 0; j < 11; j++) //converting small letters to caps
 if ((fileNameFAT[j] >= 0x61) && (fileNameFAT[j] <= 0x7a))
 fileNameFAT[j] -= 0x20;

 for (j = 0; j < 11; j++)
 fileName[j] = fileNameFAT[j];

