funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
 return 0;
 }*/

//************************************************************************************
//Function: to create a file in FAT32 format in the root directory if given
//      file name does not exist; if the file already exists then append the data
//Arguments: pointer to the file name
//return: none
//************************************************************************************
uint8_t F32_writeFile(uint8_t *fileName, uint8_t *dataString) {
	uint8_t j, k, data = 0, error, fileCreatedFlag = 0, start = 0, appendFile =
	0, sector = 0;
	uint16_t i, firstClusterHigh = 0, firstClusterLow = 0; //value 0 is assigned just to avoid warning in compilation
	struct dir_Structure *dir;
	uint32_t cluster, nextCluster, prevCluster, firstSector, clusterCount,
	extraMemory;

	j = F32_readFile(VERIFY, fileName);

	if (j == 1) {
#ifdef ENABLE_SD_CARD_DEBUG
		serial_puts_f("\r\nFile already exists, appending data..");
#endif
		appendFile = 1;
		cluster = appendStartCluster;
		clusterCount = 0;
		while (1) {
			nextCluster = F32_getSetNextCluster(cluster, GET, 0);
			if (nextCluster == FAT32_EOF)
			break;
			cluster = nextCluster;
			clusterCount++;
		}

		sector = (fileSize - (clusterCount * sectorPerCluster * bytesPerSector))
		/ bytesPerSector; //last sector number of the last cluster of the file
		start = 1;
	} else if (j == 2)
	return 1; //invalid file name

	else {
#ifdef ENABLE_SD_CARD_DEBUG
		//TX_NEWLINE;
		serial_puts_f("\r\nCreating File..");
#endif
		cluster = F32_getSetFreeCluster(NEXT_FREE, GET, 0);
		if (cluster > totalClusters)
		cluster = rootCluster;

		cluster = F32_searchNextFreeCluster(cluster);
		if (cluster == 0) {
#ifdef ENABLE_SD_CARD_DEBUG
			//TX_NEWLINE;
			serial_puts_f("\r\nNo free cluster!");
#endif
			return 1;
		}
		F32_getSetNextCluster(cluster, SET, FAT32_EOF); //last cluster of the file, marked EOF

		firstClusterHigh = (uint16_t) ((cluster & 0xffff0000) >> 16);
		firstClusterLow = (uint16_t) (cluster & 0x0000ffff);
		fileSize = 0;
	}

	k = 0;

	while (1) {
		if (start) {
			start = 0;
			SD_startBlock = F32_getFirstSector(cluster) + sector;
			SD_readSingleBlock(SD_startBlock);
			i = fileSize % bytesPerSector;
			j = sector;
		} else {
			SD_startBlock = F32_getFirstSector(cluster);
			i = 0;
			j = 0;
		}

		do {
			data = dataString[k++];
#ifdef ENABLE_SD_CARD_DEBUG
			serial_putchar(data); // was data
#endif
			SD_buffer[i++] = data;
			fileSize++;

			if (i >= 512) //though 'i' will never become greater than 512, it's kept here to avoid
			{ //infinite loop in case it happens to be greater than 512 due to some data corruption
				i = 0;
				error = SD_writeSingleBlock(SD_startBlock);
				j++;
				if (j == sectorPerCluster) {
					j = 0;
					break;
				}
				SD_startBlock++;
			}
		}while ((data != '\n') && (k < MAX_STRING_SIZE)); //stop when newline character is found
		//or when string size limit reached

		if ((data == '\n') || (k >= MAX_STRING_SIZE)) {
			for (; i < 512; i++) //fill the rest of the buffer with 0x00
			SD_buffer[i] = 0x00;
			error = SD_writeSingleBlock(SD_startBlock);

			break;
		}

		prevCluster = cluster;

		cluster = F32_searchNextFreeCluster(prevCluster); //look for a free cluster starting from the current cluster

		if (cluster == 0) {
#ifdef ENABLE_SD_CARD_DEBUG
			//TX_NEWLINE;
			serial_puts_f("\r\nNo free cluster!");
#endif
			return 1;
		}

		F32_getSetNextCluster(prevCluster, SET, cluster);
		F32_getSetNextCluster(cluster, SET, FAT32_EOF); //last cluster of the file, marked EOF
	}

	F32_getSetFreeCluster(NEXT_FREE, SET, cluster); //update FSinfo next free cluster entry

	error = getDateTime_FAT();//get current date & time from the RTC
	if (error) {
		dateFAT = 0;
		timeFAT = 0;
	}

	if (appendFile) //executes this loop if file is to be appended
	{
		SD_readSingleBlock(appendFileSector);
		dir = (struct dir_Structure *) &SD_buffer[appendFileLocation];

		dir->lastAccessDate = 0; //date of last access ignored
		dir->writeTime = timeFAT;//setting new time of last write, obtained from RTC
		dir->writeDate = dateFAT;//setting new date of last write, obtained from RTC
		extraMemory = fileSize - dir->fileSize;
		dir->fileSize = fileSize;
		SD_writeSingleBlock(appendFileSector);
		F32_freeMemoryUpdate(REMOVE, extraMemory);//updating free memory count in FSinfo sector;

#ifdef ENABLE_SD_CARD_DEBUG
		//TX_NEWLINE;
		serial_puts_f("\r\nFile appended!");
#endif
		return 0;
	}

//executes following portion when new file is created

	prevCluster = rootCluster;//root cluster

	while (1) {
		firstSector = F32_getFirstSector(prevCluster);

		for (sector = 0; sector < sectorPerCluster; sector++) {
			SD_readSingleBlock(firstSector + sector);

			for (i = 0; i < bytesPerSector; i += 32) {
				dir = (struct dir_Structure *) &SD_buffer[i];

				if (fileCreatedFlag) //to mark last directory entry with 0x00 (empty) mark
				{ //indicating end of the directory file list
				  //dir->name[0] = EMPTY;
				  //SD_writeSingleBlock (firstSector + sector);
					return 0;
				}

				if ((dir->name[0] == EMPTY) || (dir->name[0] == DELETED)) //looking for an empty slot to enter file info
				{
					for (j = 0; j < 11; j++)
					dir->name[j] = fileName[j];
					dir->attrib = ATTR_ARCHIVE; //setting file attribute as 'archive'
					dir->NTreserved = 0;//always set to 0
					dir->timeTenth = 0;//always set to 0
					dir->createTime = timeFAT;//setting time of file creation, obtained from RTC
					dir->createDate = dateFAT;//setting date of file creation, obtained from RTC
					dir->lastAccessDate = 0;//date of last access ignored
					dir->writeTime = timeFAT;//setting new time of last write, obtained from RTC
					dir->writeDate = dateFAT;//setting new date of last write, obtained from RTC
					dir->firstClusterHI = firstClusterHigh;
					dir->firstClusterLO = firstClusterLow;
					dir->fileSize = fileSize;

					SD_writeSingleBlock(firstSector + sector);
					fileCreatedFlag = 1;
#ifdef ENABLE_SD_CARD_DEBUG
					//TX_NEWLINE;
					//TX_NEWLINE;
					serial_puts_f("\r\nFile Created! ");
#endif

					F32_freeMemoryUpdate(REMOVE, fileSize); //updating free memory count in FSinfo sector

