funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
				}
			}
		}

		cluster = F32_getSetNextCluster(prevCluster, GET, 0);

		if (cluster > 0x0ffffff6) {
			if (cluster == FAT32_EOF) //this situation will come when total files in root is multiple of (32*sectorPerCluster)
			{
				cluster = F32_searchNextFreeCluster(prevCluster); //find next cluster for root directory entries
				F32_getSetNextCluster(prevCluster, SET, cluster);//link the new cluster of root to the previous cluster
				F32_getSetNextCluster(cluster, SET, FAT32_EOF);//set the new cluster as end of the root directory
			}

			else {
#ifdef ENABLE_SD_CARD_DEBUG
				serial_puts_f("\r\nEnd of Cluster Chain");
#endif
				return 1;
			}
		}
		if (cluster == 0) {
#ifdef ENABLE_SD_CARD_DEBUG
			serial_puts_f("\r\nError in getting cluster");
#endif
			return 1;
		}

		prevCluster = cluster;
	}

	return 0;
}

//***************************************************************************
//Function: to search for the next free cluster in the root directory
//          starting from a specified cluster
//Arguments: Starting cluster
//return: the next free cluster
//****************************************************************
uint32_t F32_searchNextFreeCluster(uint32_t startCluster) {
	uint32_t cluster, *value, sector;
	uint8_t i;

	startCluster -= (startCluster % 128); //to start with the first file in a FAT sector
	for (cluster = startCluster; cluster < totalClusters; cluster += 128) {
		sector = unusedSectors + reservedSectorCount
		+ ((cluster * 4) / bytesPerSector);
		SD_readSingleBlock(sector);
		for (i = 0; i < 128; i++) {
			value = (uint32_t *) &SD_buffer[i * 4];
			if (((*value) & 0x0fffffff) == 0)
			return (cluster + i);
		}
	}

	return 0;
}

//************************************************************
//Function: To convert the uint32_t value of memory into
//          text string and send to UART
//Arguments: 1. uint8_t flag. If flag is HIGH, memory will be displayed in KBytes, else in Bytes.
//       2. uint32_t memory value
//return: none
//************************************************************
void F32_displayMemory(uint8_t flag, uint32_t memory) {
	uint8_t memoryString[] = "              Bytes"; //19 character long string for memory display
	uint8_t i;
	for (i = 12; i > 0; i--)//converting freeMemory into ASCII string
	{
		if (i == 5 || i == 9) {
			memoryString[i - 1] = ',';
			i--;
		}
		memoryString[i - 1] = (memory % 10) | 0x30;
		memory /= 10;
		if (memory == 0)
		break;
	}
	if (flag == HIGH)
	memoryString[13] = 'K';
#if defined(ENABLE_SERIAL) || defined(ENABLE_SERIAL_POLL)
	serial_puts(memoryString);
#endif
}

//********************************************************************
//Function: to delete a specified file from the root directory
//Arguments: pointer to the file name
//return: none
//********************************************************************
void F32_deleteFile(uint8_t *fileName) {
	//uint8_t error;

	//error = F32_convertFileName(fileName);
	//if (error)
	//	return;

	F32_findFiles(DELETE, fileName);
}

//********************************************************************
//Function: update the free memory count in the FSinfo sector.
//      Whenever a file is deleted or created, this function will be called
//      to ADD or REMOVE clusters occupied by the file
//Arguments: #1.flag ADD or REMOVE #2.file size in Bytes
//return: none
//********************************************************************
void F32_freeMemoryUpdate(uint8_t flag, uint32_t size) {
	uint32_t freeClusters;
	//convert file size into number of clusters occupied
	if ((size % 512) == 0)
	size = size / 512;
	else
	size = (size / 512) + 1;
	if ((size % 8) == 0)
	size = size / 8;
	else
	size = (size / 8) + 1;

	if (freeClusterCountUpdated) {
		freeClusters = F32_getSetFreeCluster(TOTAL_FREE, GET, 0);
		if (flag == ADD)
		freeClusters = freeClusters + size;
		else
		//when flag = REMOVE
		freeClusters = freeClusters - size;
		F32_getSetFreeCluster(TOTAL_FREE, SET, freeClusters);
	}
}

//******** END ****** www.dharmanitech.com *****
#endif //ENABLE_FAT32
//--
#ifdef ENABLE_ONE_WIRE
#ifdef OW_ONE_BUS

#define OW_GET_IN()   ( OW_IN & (1<<OW_PIN))
#define OW_OUT_LOW()  ( OW_OUT &= (~(1 << OW_PIN)) )
#define OW_OUT_HIGH() ( OW_OUT |= (1 << OW_PIN) )
#define OW_DIR_IN()   ( OW_DDR &= (~(1 << OW_PIN )) )
#define OW_DIR_OUT()  ( OW_DDR |= (1 << OW_PIN) )

#else

/* set bus-config with ow_set_bus() */
uint8_t OW_PIN_MASK;
volatile uint8_t* OW_IN;
volatile uint8_t* OW_OUT;
volatile uint8_t* OW_DDR;

#define OW_GET_IN()   ( *OW_IN & OW_PIN_MASK )
#define OW_OUT_LOW()  ( *OW_OUT &= (uint8_t) ~OW_PIN_MASK )
#define OW_OUT_HIGH() ( *OW_OUT |= (uint8_t)  OW_PIN_MASK )
#define OW_DIR_IN()   ( *OW_DDR &= (uint8_t) ~OW_PIN_MASK )
#define OW_DIR_OUT()  ( *OW_DDR |= (uint8_t)  OW_PIN_MASK )

void ow_set_bus(volatile uint8_t* in,
		volatile uint8_t* out,
		volatile uint8_t* ddr,
		uint8_t pin)
{
	OW_DDR=ddr;
	OW_OUT=out;
	OW_IN=in;
	OW_PIN_MASK = (1 << pin);
	ow_reset();
}

#endif

uint8_t ow_input_pin_state() {
	return OW_GET_IN();
}

void ow_parasite_enable(void) {
	OW_OUT_HIGH();
	OW_DIR_OUT();
}

void ow_parasite_disable(void) {
	OW_DIR_IN();
#if (!OW_USE_INTERNAL_PULLUP)
	OW_OUT_LOW();
#endif
}

uint8_t ow_reset(void) {
	uint8_t err;

	OW_OUT_LOW();
	OW_DIR_OUT(); // pull OW-Pin low for 480us
	_delay_us(480);

	ATOMIC_BLOCK(ATOMIC_RESTORESTATE) {
		// set Pin as input - wait for clients to pull low
		OW_DIR_IN();// input
#if OW_USE_INTERNAL_PULLUP
		OW_OUT_HIGH();
#endif

		_delay_us(64); // was 66
		err = OW_GET_IN();// no presence detect
						  // if err!=0: nobody pulled to low, still high
	}

	// after a delay the clients should release the line
	// and input-pin gets back to high by pull-up-resistor
	_delay_us(480 - 64);// was 480-66
	if (OW_GET_IN() == 0) {
		err = 1; // short circuit, expected low but got high
	}

	return err;
}

/* Timing issue when using runtime-bus-selection (!OW_ONE_BUS):
 The master should sample at the end of the 15-slot after initiating
 the read-time-slot. The variable bus-settings need more
 cycles than the constant ones so the delays had to be shortened
 to achieve a 15uS overall delay
 Setting/clearing a bit in I/O Register needs 1 cyle in OW_ONE_BUS
 but around 14 cyles in configurable bus (us-Delay is 4 cyles per uS) */
static uint8_t ow_bit_io_intern(uint8_t b, uint8_t with_parasite_enable) {
	ATOMIC_BLOCK(ATOMIC_RESTORESTATE) {
#if OW_USE_INTERNAL_PULLUP
		OW_OUT_LOW();
#endif
		OW_DIR_OUT(); // drive bus low
		_delay_us(2);// T_INT > 1usec accoding to timing-diagramm
		if (b) {
			OW_DIR_IN(); // to write "1" release bus, resistor pulls high
#if OW_USE_INTERNAL_PULLUP
			OW_OUT_HIGH();
#endif
		}

		// "Output data from the DS18B20 is valid for 15usec after the falling
		// edge that initiated the read time slot. Therefore, the master must
		// release the bus and then sample the bus state within 15ussec from
		// the start of the slot."
		_delay_us(15 - 2 - OW_CONF_DELAYOFFSET);

		if (OW_GET_IN() == 0) {
			b = 0; // sample at end of read-timeslot
		}

		_delay_us(60 - 15 - 2 + OW_CONF_DELAYOFFSET);
#if OW_USE_INTERNAL_PULLUP
		OW_OUT_HIGH();
#endif
		OW_DIR_IN();

		if (with_parasite_enable) {
			ow_parasite_enable();
		}

	} /* ATOMIC_BLOCK */

	_delay_us(OW_RECOVERY_TIME); // may be increased for longer wires

	return b;
}

