funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
uint8_t ow_bit_io(uint8_t b) {
	return ow_bit_io_intern(b & 1, 0);
}

uint8_t ow_byte_wr(uint8_t b) {
	uint8_t i = 8, j;

	do {
		j = ow_bit_io(b & 1);
		b >>= 1;
		if (j) {
			b |= 0x80;
		}
	}while (--i);

	return b;
}

uint8_t ow_byte_wr_with_parasite_enable(uint8_t b) {
	uint8_t i = 8, j;

	do {
		if (i != 1) {
			j = ow_bit_io_intern(b & 1, 0);
		} else {
			j = ow_bit_io_intern(b & 1, 1);
		}
		b >>= 1;
		if (j) {
			b |= 0x80;
		}
	}while (--i);

	return b;
}

uint8_t ow_byte_rd(void) {
	// read by sending only "1"s, so bus gets released
	// after the init low-pulse in every slot
	return ow_byte_wr(0xFF);
}

uint8_t ow_rom_search(uint8_t diff, uint8_t *id) {
	uint8_t i, j, next_diff;
	uint8_t b;

	if (ow_reset()) {
		return OW_PRESENCE_ERR; // error, no device found <--- early exit!
	}

	ow_byte_wr(OW_SEARCH_ROM); // ROM search command
	next_diff = OW_LAST_DEVICE;// unchanged on last device

	i = OW_ROMCODE_SIZE * 8;// 8 bytes

	do {
		j = 8; // 8 bits
		do {
			b = ow_bit_io(1); // read bit
			if (ow_bit_io(1)) { // read complement bit
				if (b) { // 0b11
					return OW_DATA_ERR;// data error <--- early exit!
				}
			} else {
				if (!b) { // 0b00 = 2 devices
					if (diff > i || ((*id & 1) && diff != i)) {
						b = 1; // now 1
						next_diff = i;// next pass 0
					}
				}
			}
			ow_bit_io(b); // write bit
			*id >>= 1;
			if (b) {
				*id |= 0x80; // store bit
			}

			i--;

		}while (--j);

		id++; // next byte

	}while (i);

	return next_diff; // to continue search
}

static void ow_command_intern(uint8_t command, uint8_t *id,
		uint8_t with_parasite_enable) {
	uint8_t i;

	ow_reset();

	if (id) {
		ow_byte_wr(OW_MATCH_ROM); // to a single device
		i = OW_ROMCODE_SIZE;
		do {
			ow_byte_wr(*id);
			id++;
		}while (--i);
	} else {
		ow_byte_wr(OW_SKIP_ROM); // to all devices
	}

	if (with_parasite_enable) {
		ow_byte_wr_with_parasite_enable(command);
	} else {
		ow_byte_wr(command);
	}
}

void ow_command(uint8_t command, uint8_t *id) {
	ow_command_intern(command, id, 0);
}

void ow_command_with_parasite_enable(uint8_t command, uint8_t *id) {
	ow_command_intern(command, id, 1);
}

#ifdef ENABLE_DS18_2_

#define CRC8INIT    0x00
#define CRC8POLY    0x18              //0X18 = X^8+X^5+X^4+X^0
uint8_t crc8(uint8_t *data, uint16_t number_of_bytes_in_data) {
	uint8_t crc;
	uint16_t loop_count;
	uint8_t bit_counter;
	uint8_t b;
	uint8_t feedback_bit;

	crc = CRC8INIT;

	for (loop_count = 0; loop_count != number_of_bytes_in_data; loop_count++) {
		b = data[loop_count];

		bit_counter = 8;
		do {
			feedback_bit = (crc ^ b) & 0x01;

			if (feedback_bit == 0x01) {
				crc = crc ^ CRC8POLY;
			}
			crc = (crc >> 1) & 0x7F;
			if (feedback_bit == 0x01) {
				crc = crc | 0x80;
			}

			b = b >> 1;
			bit_counter--;

		}while (bit_counter > 0);
	}

	return crc;
}
//
/*----------- start of "debug-functions" ---------------*/

#if DS18X20_VERBOSE
#if (!DS18X20_DECICELSIUS)
#error "DS18X20_DECICELSIUS must be enabled for verbose-mode"
#endif

/* functions for debugging-output - undef DS18X20_VERBOSE in .h
 if you run out of program-memory */

static int16_t DS18X20_raw_to_decicelsius(uint8_t fc, uint8_t sp[]);

void DS18X20_show_id_uart(uint8_t *id, size_t n) {
	size_t i;

	for (i = 0; i < n; i++) {
		if (i == 0) {
			serial_puts_f("FC:");
		} else if (i == n - 1) {
			serial_puts_f("CRC:");
		}
		if (i == 1) {
			serial_puts_f("SN: ");
		}
		serial_puthexU08(id[i]);
		serial_puts_f(" ");
		if (i == 0) {
			if (id[0] == DS18S20_FAMILY_CODE) {
				serial_puts_f("(18S)");
			} else if (id[0] == DS18B20_FAMILY_CODE) {
				serial_puts_f("(18B)");
			} else if (id[0] == DS1822_FAMILY_CODE) {
				serial_puts_f("(22)");
			} else {
				serial_puts_f("( ? )");
			}
		}
	}
	if (crc8(id, OW_ROMCODE_SIZE))
	serial_puts_f(" CRC FAIL ");
	else
	serial_puts_f(" CRC O.K. ");
}

static void show_sp_uart(uint8_t *sp, size_t n) {
	size_t i;

	serial_puts_f("SP:");
	for (i = 0; i < n; i++) {
		if (i == n - 1) {
			serial_puts_f("CRC:");
		}
		serial_puthexU08(sp[i]);
		serial_puts_f(" ");
	}
}

/*
 convert raw value from DS18x20 to Celsius
 input is:
 - familycode fc (0x10/0x28 see header)
 - scratchpad-buffer
 output is:
 - cel full celsius
 - fractions of celsius in millicelsius*(10^-1)/625 (the 4 LS-Bits)
 - subzero =0 positive / 1 negative
 always returns  DS18X20_OK
 */
static uint8_t DS18X20_meas_to_cel(uint8_t fc, uint8_t *sp, uint8_t* subzero,
		uint8_t* cel, uint8_t* cel_frac_bits) {
	uint16_t meas;
	uint8_t i;

	meas = sp[0]; // LSB
	meas |= ((uint16_t) sp[1]) << 8;// MSB

	//  only work on 12bit-base
	if (fc == DS18S20_FAMILY_CODE) { // 9 -> 12 bit if 18S20
		/* Extended res. measurements for DS18S20 contributed by Carsten Foss */
		meas &= (uint16_t) 0xfffe; // Discard LSB, needed for later extended precicion calc
		meas <<= 3;// Convert to 12-bit, now degrees are in 1/16 degrees units
		meas += (16 - sp[6]) - 4;// Add the compensation and remember to subtract 0.25 degree (4/16)
	}

	// check for negative
	if (meas & 0x8000) {
		*subzero = 1; // mark negative
		meas ^= 0xffff;// convert to positive => (twos complement)++
		meas++;
	} else {
		*subzero = 0;
	}

	// clear undefined bits for B != 12bit
	if (fc == DS18B20_FAMILY_CODE || fc == DS1822_FAMILY_CODE) {
		i = sp[DS18B20_CONF_REG];
		if ((i & DS18B20_12_BIT) == DS18B20_12_BIT) {
			;
		} else if ((i & DS18B20_11_BIT) == DS18B20_11_BIT) {
			meas &= ~(DS18B20_11_BIT_UNDF);
		} else if ((i & DS18B20_10_BIT) == DS18B20_10_BIT) {
			meas &= ~(DS18B20_10_BIT_UNDF);
		} else { // if ( (i & DS18B20_9_BIT) == DS18B20_9_BIT ) {
			meas &= ~(DS18B20_9_BIT_UNDF);
		}
	}

	*cel = (uint8_t) (meas >> 4);
	*cel_frac_bits = (uint8_t) (meas & 0x000F);

	return DS18X20_OK;
}

static void DS18X20_uart_put_temp(const uint8_t subzero, const uint8_t cel,
		const uint8_t cel_frac_bits) {
	char buffer[sizeof(int) * 8 + 1];
	size_t i;

	serial_putchar((subzero) ? '-' : '+');
	serial_putint((int) cel);
	serial_puts_f(".");
	itoa(cel_frac_bits * DS18X20_FRACCONV, buffer, 10);
	for (i = 0; i < 4 - strlen(buffer); i++) {
		serial_puts_f("0");
	}
	serial_puts(buffer);
	serial_puts_f("_C");
}

/* verbose output rom-search follows read-scratchpad in one loop */
uint8_t DS18X20_read_meas_all_verbose(void) {
	uint8_t id[OW_ROMCODE_SIZE], sp[DS18X20_SP_SIZE], diff;
	uint8_t i;
	uint16_t meas;
	int16_t decicelsius;
	int8_t s[10];
	uint8_t subzero, cel, cel_frac_bits;

	for (diff = OW_SEARCH_FIRST; diff != OW_LAST_DEVICE;) {
		diff = ow_rom_search(diff, &id[0]);

		if (diff == OW_PRESENCE_ERR) {
			serial_puts_f("No Sensor found\r\n");
			return OW_PRESENCE_ERR; // <--- early exit!
		}

