funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
		if (diff == OW_DATA_ERR) {
			serial_puts_f("Bus Error\r\n");
			return OW_DATA_ERR; // <--- early exit!
		}

		DS18X20_show_id_uart(id, OW_ROMCODE_SIZE);

		if (id[0] == DS18B20_FAMILY_CODE || id[0] == DS18S20_FAMILY_CODE
				|| id[0] == DS1822_FAMILY_CODE) {
			// temperature sensor

			serial_puts_f("\r\n");

			ow_byte_wr(DS18X20_READ);// read command

			for (i = 0; i < DS18X20_SP_SIZE; i++) {
				sp[i] = ow_byte_rd();
			}

			show_sp_uart(sp, DS18X20_SP_SIZE);

			if (crc8(&sp[0], DS18X20_SP_SIZE)) {
				serial_puts_f(" CRC FAIL ");
			} else {
				serial_puts_f(" CRC O.K. ");
			}
			serial_puts_f("\r\n");

			meas = sp[0]; // LSB Temp. from Scrachpad-Data
			meas |= (uint16_t) (sp[1] << 8);// MSB

			serial_puts_f(" T_raw=");
			serial_puthexU08((uint8_t) (meas >> 8));
			serial_puthexU08((uint8_t) meas);
			serial_puts_f(" ");

			if (id[0] == DS18S20_FAMILY_CODE) { // 18S20
				serial_puts_f("S20/09");
			} else if (id[0] == DS18B20_FAMILY_CODE
					|| id[0] == DS1822_FAMILY_CODE) { // 18B20 or 1822
				i = sp[DS18B20_CONF_REG];
				if ((i & DS18B20_12_BIT) == DS18B20_12_BIT) {
					serial_puts_f("B20/12");
				} else if ((i & DS18B20_11_BIT) == DS18B20_11_BIT) {
					serial_puts_f("B20/11");
				} else if ((i & DS18B20_10_BIT) == DS18B20_10_BIT) {
					serial_puts_f(" B20/10 ");
				} else { // if ( (i & DS18B20_9_BIT) == DS18B20_9_BIT ) {
					serial_puts_f("B20/09");
				}
			}
			serial_puts_f(" ");

			DS18X20_meas_to_cel(id[0], sp, &subzero, &cel, &cel_frac_bits);
			DS18X20_uart_put_temp(subzero, cel, cel_frac_bits);

			decicelsius = DS18X20_raw_to_decicelsius(id[0], sp);
			if (decicelsius == DS18X20_INVALID_DECICELSIUS) {
				serial_puts_f("* INVALID *");
			} else {
				serial_puts_f(" conv: ");
				serial_putint(decicelsius);
				serial_puts_f(" deci_C ");
				DS18X20_format_from_decicelsius(decicelsius, s, 10);
				serial_puts_f(" fmt: ");
				serial_puts(s);
				serial_puts_f("_C ");
			}

			serial_puts_f("\r\n");

		} // if meas-sensor

	} // loop all sensors

	serial_puts_f("\r\n");

	return DS18X20_OK;
}

#endif /* DS18X20_VERBOSE */

#if DS18X20_VERBOSE
#define uart_puts_P_verbose(s__)  serial_putstr_f((int8_t *)PSTR(s__))
#else
#define uart_puts_P_verbose(s__)
#endif

/*----------- end of "debug-functions" ---------------*/

/* find DS18X20 Sensors on 1-Wire-Bus
 input/ouput: diff is the result of the last rom-search
 *diff = OW_SEARCH_FIRST for first call
 output: id is the rom-code of the sensor found */
uint8_t DS18X20_find_sensor(uint8_t *diff, uint8_t id[]) {
	uint8_t go;
	uint8_t ret;

	ret = DS18X20_OK;
	go = 1;
	do {
		*diff = ow_rom_search(*diff, &id[0]);
		if (*diff == OW_PRESENCE_ERR || *diff == OW_DATA_ERR
				|| *diff == OW_LAST_DEVICE) {
			go = 0;
			ret = DS18X20_ERROR;
		} else {
			if (id[0] == DS18B20_FAMILY_CODE || id[0] == DS18S20_FAMILY_CODE
					|| id[0] == DS1822_FAMILY_CODE) {
				go = 0;
			}
		}
	}while (go);

	return ret;
}

/* get power status of DS18x20
 input:   id = rom_code
 returns: DS18X20_POWER_EXTERN or DS18X20_POWER_PARASITE */
uint8_t DS18X20_get_power_status(uint8_t id[]) {
	uint8_t pstat;

	ow_reset();
	ow_command(DS18X20_READ_POWER_SUPPLY, id);
	pstat = ow_bit_io(1);
	ow_reset();
	return (pstat) ? DS18X20_POWER_EXTERN : DS18X20_POWER_PARASITE;
}

/* start measurement (CONVERT_T) for all sensors if input id==NULL
 or for single sensor where id is the rom-code */
uint8_t DS18X20_start_meas(uint8_t with_power_extern, uint8_t id[]) {
	uint8_t ret;

	ow_reset();
	if (ow_input_pin_state()) { // only send if bus is "idle" = high
		if (with_power_extern != DS18X20_POWER_EXTERN) {
			ow_command_with_parasite_enable(DS18X20_CONVERT_T, id);
			/* not longer needed: ow_parasite_enable(); */
		} else {
			ow_command(DS18X20_CONVERT_T, id);
		}
		ret = DS18X20_OK;
	} else {
#if DS18X20_VERBOSE
		serial_puts_f( "DS18X20_start_meas: Short Circuit!\r\n");
#endif
		ret = DS18X20_START_FAIL;
	}

	return ret;
}

// returns 1 if conversion is in progress, 0 if finished
// not available when parasite powered.
uint8_t DS18X20_conversion_in_progress(void) {
	return ow_bit_io(1) ? DS18X20_CONVERSION_DONE : DS18X20_CONVERTING;
}

static uint8_t read_scratchpad(uint8_t id[], uint8_t sp[], uint8_t n) {
	uint8_t i;
	uint8_t ret;

	ow_command(DS18X20_READ, id);
	for (i = 0; i < n; i++) {
		sp[i] = ow_byte_rd();
	}
	if (crc8(&sp[0], DS18X20_SP_SIZE)) {
		ret = DS18X20_ERROR_CRC;
	} else {
		ret = DS18X20_OK;
	}

	return ret;
}

#if DS18X20_DECICELSIUS

/* convert scratchpad data to physical value in unit decicelsius */
static int16_t DS18X20_raw_to_decicelsius(uint8_t familycode, uint8_t sp[]) {
	uint16_t measure;
	uint8_t negative;
	int16_t decicelsius;
	uint16_t fract;

	measure = sp[0] | (sp[1] << 8);
	//measure = 0xFF5E; // test -10.125
	//measure = 0xFE6F; // test -25.0625

	if (familycode == DS18S20_FAMILY_CODE) { // 9 -> 12 bit if 18S20
		/* Extended measurements for DS18S20 contributed by Carsten Foss */
		measure &= (uint16_t) 0xfffe; // Discard LSB, needed for later extended precicion calc
		measure <<= 3;// Convert to 12-bit, now degrees are in 1/16 degrees units
		measure += (16 - sp[6]) - 4;// Add the compensation and remember to subtract 0.25 degree (4/16)
	}

	// check for negative
	if (measure & 0x8000) {
		negative = 1; // mark negative
		measure ^= 0xffff;// convert to positive => (twos complement)++
		measure++;
	} else {
		negative = 0;
	}

	// clear undefined bits for DS18B20 != 12bit resolution
	if (familycode == DS18B20_FAMILY_CODE || familycode == DS1822_FAMILY_CODE) {
		switch (sp[DS18B20_CONF_REG] & DS18B20_RES_MASK) {
			case DS18B20_9_BIT:
			measure &= ~(DS18B20_9_BIT_UNDF);
			break;
			case DS18B20_10_BIT:
			measure &= ~(DS18B20_10_BIT_UNDF);
			break;
			case DS18B20_11_BIT:
			measure &= ~(DS18B20_11_BIT_UNDF);
			break;
			default:
			// 12 bit - all bits valid
			break;
		}
	}

	decicelsius = (measure >> 4);
	decicelsius *= 10;

	// decicelsius += ((measure & 0x000F) * 640 + 512) / 1024;
	// 625/1000 = 640/1024
	fract = (measure & 0x000F) * 640;
	if (!negative) {
		fract += 512;
	}
	fract /= 1024;
	decicelsius += fract;

