funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
	if (negative) {
		decicelsius = -decicelsius;
	}

	if ( /* decicelsius == 850 || */decicelsius < -550 || decicelsius > 1250) {
		return DS18X20_INVALID_DECICELSIUS;
	} else {
		return decicelsius;
	}
}

/* format decicelsius-value into string, itoa method inspired
 by code from Chris Takahashi for the MSP430 libc, BSD-license
 modifications mthomas: variable-types, fixed radix 10, use div(),
 insert decimal-point */
uint8_t DS18X20_format_from_decicelsius(int16_t decicelsius, int8_t str[],
		uint8_t n) {
	uint8_t sign = 0;
	int8_t temp[7];
	int8_t temp_loc = 0;
	uint8_t str_loc = 0;
	div_t dt;
	uint8_t ret;

	// range from -550:-55.0°C to 1250:+125.0°C -> min. 6+1 chars
	if (n >= (6 + 1) && decicelsius > -1000 && decicelsius < 10000) {

		if (decicelsius < 0) {
			sign = 1;
			decicelsius = -decicelsius;
		}

		// construct a backward string of the number.
		do {
			dt = div(decicelsius, 10);
			temp[temp_loc++] = dt.rem + '0';
			decicelsius = dt.quot;
		}while (decicelsius > 0);

		if (sign) {
			temp[temp_loc] = '-';
		} else {
			///temp_loc--;
			temp[temp_loc] = '+';
		}

		// reverse the string.into the output
		while (temp_loc >= 0) {
			str[str_loc++] = temp[(uint8_t) temp_loc--];
			if (temp_loc == 0) {
				str[str_loc++] = DS18X20_DECIMAL_CHAR;
			}
		}
		str[str_loc] = '\0';

		ret = DS18X20_OK;
	} else {
		ret = DS18X20_ERROR;
	}

	return ret;
}

/* reads temperature (scratchpad) of sensor with rom-code id
 output: decicelsius
 returns DS18X20_OK on success */
uint8_t DS18X20_read_decicelsius(uint8_t id[], int16_t *decicelsius) {
	uint8_t sp[DS18X20_SP_SIZE];
	uint8_t ret;

	ow_reset();
	ret = read_scratchpad(id, sp, DS18X20_SP_SIZE);
	if (ret == DS18X20_OK) {
		*decicelsius = DS18X20_raw_to_decicelsius(id[0], sp);
	}
	return ret;
}

/* reads temperature (scratchpad) of sensor without id (single sensor)
 output: decicelsius
 returns DS18X20_OK on success */
uint8_t DS18X20_read_decicelsius_single(uint8_t familycode,
		int16_t *decicelsius) {
	uint8_t sp[DS18X20_SP_SIZE];
	uint8_t ret;

	ret = read_scratchpad(NULL, sp, DS18X20_SP_SIZE);
	if (ret == DS18X20_OK) {
		*decicelsius = DS18X20_raw_to_decicelsius(familycode, sp);
	}
	return ret;
}

#endif /* DS18X20_DECICELSIUS */

#if DS18X20_MAX_RESOLUTION

static int32_t DS18X20_raw_to_maxres(uint8_t familycode, uint8_t sp[]) {
	uint16_t measure;
	uint8_t negative;
	int32_t temperaturevalue;

	measure = sp[0] | (sp[1] << 8);
	//measure = 0xFF5E; // test -10.125
	//measure = 0xFE6F; // test -25.0625

	if (familycode == DS18S20_FAMILY_CODE) { // 9 -> 12 bit if 18S20
		/* Extended measurements for DS18S20 contributed by Carsten Foss */
		measure &= (uint16_t) 0xfffe; // Discard LSB, needed for later extended precicion calc
		measure <<= 3;// Convert to 12-bit, now degrees are in 1/16 degrees units
		measure += (16 - sp[6]) - 4;// Add the compensation and remember to subtract 0.25 degree (4/16)
	}

	// check for negative
	if (measure & 0x8000) {
		negative = 1; // mark negative
		measure ^= 0xffff;// convert to positive => (twos complement)++
		measure++;
	} else {
		negative = 0;
	}

	// clear undefined bits for DS18B20 != 12bit resolution
	if (familycode == DS18B20_FAMILY_CODE || familycode == DS1822_FAMILY_CODE) {
		switch (sp[DS18B20_CONF_REG] & DS18B20_RES_MASK) {
			case DS18B20_9_BIT:
			measure &= ~(DS18B20_9_BIT_UNDF);
			break;
			case DS18B20_10_BIT:
			measure &= ~(DS18B20_10_BIT_UNDF);
			break;
			case DS18B20_11_BIT:
			measure &= ~(DS18B20_11_BIT_UNDF);
			break;
			default:
			// 12 bit - all bits valid
			break;
		}
	}

	temperaturevalue = (measure >> 4);
	temperaturevalue *= 10000;
	temperaturevalue += (measure & 0x000F) * DS18X20_FRACCONV;

	if (negative) {
		temperaturevalue = -temperaturevalue;
	}

	return temperaturevalue;
}

uint8_t DS18X20_read_maxres(uint8_t id[], int32_t *temperaturevalue) {
	uint8_t sp[DS18X20_SP_SIZE];
	uint8_t ret;

	ow_reset();
	ret = read_scratchpad(id, sp, DS18X20_SP_SIZE);
	if (ret == DS18X20_OK) {
		*temperaturevalue = DS18X20_raw_to_maxres(id[0], sp);
	}
	return ret;
}

uint8_t DS18X20_read_maxres_single(uint8_t familycode,
		int32_t *temperaturevalue) {
	uint8_t sp[DS18X20_SP_SIZE];
	uint8_t ret;

	ret = read_scratchpad(NULL, sp, DS18X20_SP_SIZE);
	if (ret == DS18X20_OK) {
		*temperaturevalue = DS18X20_raw_to_maxres(familycode, sp);
	}
	return ret;

}

uint8_t DS18X20_format_from_maxres(int32_t temperaturevalue, char str[],
		uint8_t n) {
	uint8_t sign = 0;
	char temp[10];
	int8_t temp_loc = 0;
	uint8_t str_loc = 0;
	ldiv_t ldt;
	uint8_t ret;

	// range from -550000:-55.0000°C to 1250000:+125.0000°C -> min. 9+1 chars
	if (n >= (9 + 1) && temperaturevalue > -1000000L
			&& temperaturevalue < 10000000L) {

		if (temperaturevalue < 0) {
			sign = 1;
			temperaturevalue = -temperaturevalue;
		}

		do {
			ldt = ldiv(temperaturevalue, 10);
			temp[temp_loc++] = ldt.rem + '0';
			temperaturevalue = ldt.quot;
		}while (temperaturevalue > 0);

		// mk 20110209
		if ((temp_loc < 4) && (temp_loc > 1)) {
			temp[temp_loc++] = '0';
		} // mk end

		if (sign) {
			temp[temp_loc] = '-';
		} else {
			temp[temp_loc] = '+';
		}

		while (temp_loc >= 0) {
			str[str_loc++] = temp[(uint8_t) temp_loc--];
			if (temp_loc == 3) {
				str[str_loc++] = DS18X20_DECIMAL_CHAR;
			}
		}
		str[str_loc] = '\0';

		ret = DS18X20_OK;
	} else {
		ret = DS18X20_ERROR;
	}

	return ret;
}

#endif /* DS18X20_MAX_RESOLUTION */

#if DS18X20_EEPROMSUPPORT

uint8_t DS18X20_write_scratchpad(uint8_t id[], uint8_t th, uint8_t tl,
		uint8_t conf) {
	uint8_t ret;

	ow_reset();
	if (ow_input_pin_state()) { // only send if bus is "idle" = high
		ow_command(DS18X20_WRITE_SCRATCHPAD, id);
		ow_byte_wr(th);
		ow_byte_wr(tl);
		if (id[0] == DS18B20_FAMILY_CODE || id[0] == DS1822_FAMILY_CODE) {
			ow_byte_wr(conf); // config only available on DS18B20 and DS1822
		}
		ret = DS18X20_OK;
	} else {
		uart_puts_P_verbose( "DS18X20_write_scratchpad: Short Circuit!\r\n");
		ret = DS18X20_ERROR;
	}

	return ret;
}

uint8_t DS18X20_read_scratchpad(uint8_t id[], uint8_t sp[], uint8_t n) {
	uint8_t ret;

	ow_reset();
	if (ow_input_pin_state()) { // only send if bus is "idle" = high
		ret = read_scratchpad(id, sp, n);
	} else {
		uart_puts_P_verbose( "DS18X20_read_scratchpad: Short Circuit!\r\n");
		ret = DS18X20_ERROR;
	}

	return ret;
}

uint8_t DS18X20_scratchpad_to_eeprom(uint8_t with_power_extern, uint8_t id[]) {
	uint8_t ret;

	ow_reset();
	if (ow_input_pin_state()) { // only send if bus is "idle" = high
		if (with_power_extern != DS18X20_POWER_EXTERN) {
			ow_command_with_parasite_enable(DS18X20_COPY_SCRATCHPAD, id);
			/* not longer needed: ow_parasite_enable(); */
		} else {
			ow_command(DS18X20_COPY_SCRATCHPAD, id);
		}
		_delay_ms(DS18X20_COPYSP_DELAY); // wait for 10 ms
		if (with_power_extern != DS18X20_POWER_EXTERN) {
			ow_parasite_disable();
		}
		ret = DS18X20_OK;
	} else {
		uart_puts_P_verbose( "DS18X20_copy_scratchpad: Short Circuit!\r\n");
		ret = DS18X20_START_FAIL;
	}

	return ret;
}

uint8_t DS18X20_eeprom_to_scratchpad(uint8_t id[]) {
	uint8_t ret;
	uint8_t retry_count = 255;

	ow_reset();
	if (ow_input_pin_state()) { // only send if bus is "idle" = high
		ow_command(DS18X20_RECALL_E2, id);
		while (retry_count-- && !(ow_bit_io(1))) {
			;
		}
		if (retry_count) {
			ret = DS18X20_OK;
		} else {
			uart_puts_P_verbose( "DS18X20_recall_E2: timeout!\r\n");
			ret = DS18X20_ERROR;
		}
	} else {
		uart_puts_P_verbose( "DS18X20_recall_E2: Short Circuit!\r\n");
		ret = DS18X20_ERROR;
	}

	return ret;
}

#endif /* DS18X20_EEPROMSUPPORT */

#endif // ENABLE_DS18_2_
#endif //ENABLE_ONE_WIRE
//--
#ifdef ENABLE_IR
volatile uint8_t ir_readptr = 0;
volatile uint8_t ir_writeptr = 0;
volatile uint8_t ir_buffer[IR_BUFFER_SIZE];

/*****************************************************************************
 *  receive from IR Receiver - external interrupt 0 on pin PD2 (arduino pin 2)
 *                                                         PD0 on ATmega2560
 *
 * Use the external interrupt to decode the Sony IR protocol.  We use
 * both rising and falling edges to measure pulse widths.  The timer/counter
 * is needed to take these measurements.  If the address matches our device,
 * we store the command in a circular buffer for retrieval outside of
 * interrupt context.
 *
 * tested with Vishay TSOP392 IR receiver and universal remote
 ****************************************************************************/
//..

ISR(INT0_vect) {
	static uint8_t value;
	static uint8_t address;
	static uint8_t sigcount = 0;
#if defined(__AVR_ATmega48__)      || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)    || \
    defined(__AVR_ATmega16__)      || \
    defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__)
	if (PIND & _BV(2)) { // rising edge
#elif defined(__AVR_ATmega2560__) || defined(__AVR_ATmega1280__))
		if (PIND & _BV(0)) { // rising edge
#endif
			uint16_t count;
			count = TCNT0;

			onboard_led_off();

#if (F_CPU == 16000000)
			if (count < 14) { // 0
#endif
#if (F_CPU == 8000000)
				if (count < 7) { // 0
#endif
					sigcount++;
					if (sigcount < 8) {
						value = value & ~(1 << (sigcount - 1));
					} else {
						address = address & ~(1 << (sigcount - 8));
					}
#if (F_CPU == 16000000)
				} else if (count < 30) { // 1
#endif
#if (F_CPU == 8000000)
				} else if (count < 15) { // 1
#endif
					sigcount++;
					if (sigcount < 8) {
						value = value | (1 << (sigcount - 1));
					} else {
						address = address | (1 << (sigcount - 8));
					}
				} else { // this starts a new one
					sigcount = 0;
					value = 0;
					address = 0;
				}

				/* we have a command and it is for us */
				if ((sigcount == 12)
						&& ((address == 26) || (address == 17)
								|| (address == REMOTE_DEVICE_SONY_TV000))) {
					ir_buffer[ir_writeptr] = value;
					ir_writeptr = (ir_writeptr + 1) % IR_BUFFER_SIZE;
#ifdef IR_DEBOUNCE
					_delay_ms(200); /* debounce */
#endif
				}

			} else { // falling edge
				TCNT0 = 0;// reset
				onboard_led_on();
			}
		}

		/**************************************************************************
		 * ir_init
		 * AVR PD2 - arduino digital pin 2
		 **************************************************************************/
		void ir_init(void) {
#if defined(__AVR_ATmega48__)      || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)    || \
    defined(__AVR_ATmega16__)      || \
    defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__)
			cbi(DDRD, 2);
#elif defined(__AVR_ATmega2560__) || defined(__AVR_ATmega1280__))
			cbi(DDRD, 0);
#endif

			// 8-bit timer to count IR stuff
			TCCR0B |= _BV(CS02) | _BV(CS00);// CLK / 64 for 8mhz
			TCNT0 = 0;//reset the timer

			// we use external interrupt INT0 for the IR receiver
			EICRA |= _BV(ISC00);// interrupt on rising and falling edge of INT0
			EIMSK |= _BV(INT0);// enable INT0 interrupts

			ir_readptr = 0;
			ir_writeptr = 0;

			enable_onboard_led();

			// don't forget sei()
		}

		/*************************************************************************
		 * ir_get()
		 *
		 * blocks until we get the next IR value out of our buffer
		 * returns the value of the command
		 *************************************************************************/
		uint8_t ir_get(void) {
			uint8_t value;
			while (ir_writeptr == ir_readptr)
			; /* block waiting for a value */
			value = ir_buffer[ir_readptr]; /* pull out a sample*/
			ir_readptr = (ir_readptr + 1) % IR_BUFFER_SIZE;
			return value;
		}

		/*************************************************************************
		 * ir_get_nonblock()
		 *
		 * returns the value of the command
		 * returns 255 if there is not a new value for us
		 *************************************************************************/
		uint8_t ir_get_nonblock(void) {
			if (ir_writeptr == ir_readptr) /* don't block waiting for a value */
			return 255;

