funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
			if ((pwmno == 3) || (pwmno == 4)) ///* TCNT1 */
			{
				if (pwmno == 3) {
#if defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__) // Sanguino
					sbi(DDRD, DDD7);
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__) // Arduino Mega1280
					sbi(DDRB, DDB4);
#elif defined(__AVR_ATmega48__)    || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)
					sbi(DDRB, 3);
#endif
					OCR2A = 0; ///* initial value */
					TCCR2A |= _BV(COM2A1);///* turn on PWM 1 */
				}
				if (pwmno == 4) {
#if defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__) // Sanguino
					sbi(DDRD, DDD6);
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__) // Arduino Mega1280
					sbi(DDRH, DDH6);
#elif defined(__AVR_ATmega48__)    || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)
					sbi(DDRD, 3);
#endif
					OCR2B = 0;
					TCCR2A |= _BV(COM2B1); ///* turn on PWM 2 */
				}
				TCCR2A |= _BV(WGM20); ///* PWM 8bit */
				TCCR2B |= _BV(CS21) | _BV(CS22);// /* div by 256 for ovfl 244hz*/
				TCNT2 = 0;///* initial value */
			}
#if !defined(ENABLE_IR) && !defined(ENABLE_MILLIS)
			// define the next two channels (5 & 6)
#endif
		}

		/***************************************************************************
		 * pwm_set
		 * pwmchan - 1-6 (servo number that we already called init on)
		 * pwmval - from 0-255 - provides the position for the servo
		 *          0 makes a 1.5ms pulse
		 *          255 makes a 2.5ms pulse
		 ***************************************************************************/
		void pwm_set(uint8_t pwmchan, uint8_t pwmval) {
			//printf("__pwm_set setting %d\n\r", pwmval);
			if (pwmchan == 1)
			OCR1A = pwmval;
			else if (pwmchan == 2)
			OCR1B = pwmval;
			else if (pwmchan == 3)
			OCR2A = pwmval;
			else if (pwmchan == 4)
			OCR2B = pwmval;
		}

		/* not tested yet
		 void pwm_setf(uint8_t pwmchan, float pwmval)
		 {
		 if (pwmchan == 1)
		 OCR1A = pwmval * 255.0;
		 else if (servo == 2)
		 OCR1B = pwmval * 255.0;
		 } */
#endif

#ifdef ENABLE_ADC
		/***************************************************************************
		 * adc_init()
		 *
		 * gets our ADC ready to take 10bit samples. See atmegaclib.h for
		 * ADC reference and prescaler definitions.
		 ***************************************************************************/
		void adc_init(uint8_t adc_reference, uint8_t adc_prescaler) {
			///* initialize the ADC - 10bit mode */
			ADMUX |= (adc_reference << 6);
			ADCSRA |= _BV(ADEN);// for now we don't do this in the ISR | _BV(ADIE);
			ADCSRA |= (adc_prescaler & 7);//adc prescaler
			//Powering ADC peripheral
#ifdef PRR0
			PRR0 &= ~_BV(PRADC);
#elif defined(PRR)
			PRR &= ~_BV(PRADC);
#endif
		}

		/***************************************************************************
		 * adc_get()
		 *
		 * adcnum - specifies which ADC pin you want to read from
		 *        - 0 through 5 corresponds to PC0-PC5 (32 pin SMD and 28 pin DIP capsule) and
		 *        - 0 through 7 corresponds to PA0-PA7 (44 pin SMD and 40 pin DIP capsule)
		 *        - 0 through 15 is for ATmega1280/2560
		 *
		 * returns 16 bit unsigned value between 0 and 1024 with 0 meaning 0v and
		 *          1024 meaning at or above voltage on AREF pin
		 ***************************************************************************/
		uint16_t adc_get(uint8_t adcnum) {
			static uint8_t current_adcnum = 17; // high enough to avoid conflict if atmega1280 support...
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
			adcnum &= 15;
#elif(defined(__AVR_ATmega16__)  || \
	defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__))
			adcnum &= 7;
#elif defined(__AVR_ATmega48__)  || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)
			adcnum &= 5;
#endif
#if defined(ADCSRB) && defined(MUX5)
			// the MUX5 bit of ADCSRB selects whether we're reading from channels
			// 0 to 7 (MUX5 low) or 8 to 15 (MUX5 high).
			ADCSRB = (ADCSRB & ~(1 << MUX5)) | (((adcnum >> 3) & 0x01) << MUX5);
#endif
			if (adcnum != current_adcnum) {
				ADMUX = (ADMUX & 0xF0) | adcnum; /* set up mux */
				current_adcnum = adcnum; /* cache for next time */
			}
			ADCSRA |= (1 << ADSC); /* start ADC conversion */
			while (ADCSRA & (1 << ADSC)) {
				;
			} /* block for the result */
			return ADC;
		}

		void adc_poweroff_digital_pinbuffer(uint8_t adcnum) {
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
			adcnum &= 15;
#elif(defined(__AVR_ATmega16__)    || \
	defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__))
			adcnum &= 7;
#elif defined(__AVR_ATmega48__)    || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)
			adcnum &= 5;
#endif
#if defined(DIDR0)
			sbi(DIDR0, adcnum);
#endif
#if defined(DIDR2)
			sbi(DIDR2, (adcnum & 7));
#endif
		}
#endif // ENABLE_ADC
//--
#ifdef ENABLE_LCD
		static void lcd_nibble(uint8_t d);
		static void lcd_byte(uint8_t d);

		uint8_t lcd_pos = LCD_LINE1;
		void lcd_init(void) {

