funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
					length = y2 - y1;
					m = ((x2 - x1) * 200) / length;
					yAlt = x1;

					for (i = 0; i <= length; i++) {
						y = ((m * i) / 200) + x1;

						if ((m * i) % 200 >= 100)
						y++;
						else if ((m * i) % 200 <= -100)
						y--;

						GLCD_DrawLine(yAlt, y1 + i, y, y1 + i, color);
						if (length <= (x2 - x1) && x1 < x2)
						yAlt = y + 1;
						else if (length <= (x1 - x2) && x1 > x2)
						yAlt = y - 1;
						else
						yAlt = y;
					}
				}
			}
		}

		void GLCD_DrawRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height,
				uint8_t color) {
			GLCD_DrawHoriLine(x, y, width, color);
			// top
			GLCD_DrawHoriLine(x, y+height, width, color);
			// bottom
			GLCD_DrawVertLine(x, y, height, color);
			// left
			GLCD_DrawVertLine(x+width, y, height, color);
			// right
		}

		void GLCD_DrawRoundRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height,
				uint8_t radius, uint8_t color) {
			int16_t tSwitch, x1 = 0, y1 = radius;
			tSwitch = 3 - 2 * radius;

			while (x1 <= y1) {
				GLCD_SetDot(x + radius - x1, y + radius - y1, color);
				GLCD_SetDot(x + radius - y1, y + radius - x1, color);

				GLCD_SetDot(x + width - radius + x1, y + radius - y1, color);
				GLCD_SetDot(x + width - radius + y1, y + radius - x1, color);

				GLCD_SetDot(x + width - radius + x1, y + height - radius + y1, color);
				GLCD_SetDot(x + width - radius + y1, y + height - radius + x1, color);

				GLCD_SetDot(x + radius - x1, y + height - radius + y1, color);
				GLCD_SetDot(x + radius - y1, y + height - radius + x1, color);

				if (tSwitch < 0) {
					tSwitch += (4 * x1 + 6);
				} else {
					tSwitch += (4 * (x1 - y1) + 10);
					y1--;
				}
				x1++;
			}

			GLCD_DrawHoriLine(x+radius, y, width-(2*radius), color);
			// top
			GLCD_DrawHoriLine(x+radius, y+height, width-(2*radius), color);
			// bottom
			GLCD_DrawVertLine(x, y+radius, height-(2*radius), color);
			// left
			GLCD_DrawVertLine(x+width, y+radius, height-(2*radius), color);
			// right
		}

		/*
		 * Hardware-Functions
		 */
		void GLCD_FillRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height,
				uint8_t color) {
			uint8_t mask, pageOffset, h, i, data;
			height++;

			pageOffset = y % 8;
			y -= pageOffset;
			mask = 0xFF;
			if (height < 8 - pageOffset) {
				mask >>= (8 - height);
				h = height;
			} else {
				h = 8 - pageOffset;
			}
			mask <<= pageOffset;

			GLCD_GotoXY(x, y);
			for (i = 0; i <= width; i++) {
				data = GLCD_ReadData();

				if (color == GLCD_BLACK) {
					data |= mask;
				} else {
					data &= ~mask;
				}

				GLCD_WriteData(data);
			}

			while (h + 8 <= height) {
				h += 8;
				y += 8;
				GLCD_GotoXY(x, y);

				for (i = 0; i <= width; i++) {
					GLCD_WriteData(color);
				}
			}

			if (h < height) {
				mask = ~(0xFF << (height - h));
				GLCD_GotoXY(x, y + 8);

				for (i = 0; i <= width; i++) {
					data = GLCD_ReadData();

					if (color == GLCD_BLACK) {
						data |= mask;
					} else {
						data &= ~mask;
					}

					GLCD_WriteData(data);
				}
			}
		}

		void GLCD_InvertRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height) {
			uint8_t mask, pageOffset, h, i, data, tmpData;
			height++;

			pageOffset = y % 8;
			y -= pageOffset;
			mask = 0xFF;
			if (height < 8 - pageOffset) {
				mask >>= (8 - height);
				h = height;
			} else {
				h = 8 - pageOffset;
			}
			mask <<= pageOffset;

			GLCD_GotoXY(x, y);
			for (i = 0; i <= width; i++) {
				data = GLCD_ReadData();
				tmpData = ~data;
				data = (tmpData & mask) | (data & ~mask);
				GLCD_WriteData(data);
			}

			while (h + 8 <= height) {
				h += 8;
				y += 8;
				GLCD_GotoXY(x, y);

				for (i = 0; i <= width; i++) {
					data = GLCD_ReadData();
					GLCD_WriteData(~data);
				}
			}

			if (h < height) {
				mask = ~(0xFF << (height - h));
				GLCD_GotoXY(x, y + 8);

				for (i = 0; i <= width; i++) {
					data = GLCD_ReadData();
					tmpData = ~data;
					data = (tmpData & mask) | (data & ~mask);
					GLCD_WriteData(data);
				}
			}
		}

		void GLCD_SetInverted(uint8_t invert) {
			if (ks0108Inverted != invert) {
				GLCD_InvertRect(0, 0, 127, 63);
				ks0108Inverted = invert;
			}
		}

		void GLCD_SetDot(uint8_t x, uint8_t y, uint8_t color) {
			uint8_t data;

			GLCD_GotoXY(x, y - y % 8); // read data from display memory
			data = GLCD_ReadData();

			if (color == GLCD_BLACK) {
				data |= 0x01 << (y % 8); // set dot
			} else {
				data &= ~(0x01 << (y % 8)); // clear dot
			}

			GLCD_WriteData(data); // write data back to display
		}

//
// Font Functions
//

		uint8_t GLCD_ReadFontData(const uint8_t* ptr) {
			return pgm_read_byte(ptr);
		}

		void GLCD_SelectFont(const uint8_t* font, ks0108FontCallback callback,
				uint8_t color) {
			ks0108Font = font;
			ks0108FontRead = callback;
			ks0108FontColor = color;
		}

		int GLCD_PutChar(char c) {
			uint8_t width = 0;
			uint8_t height = ks0108FontRead(ks0108Font + GLCD_FONT_HEIGHT);
			uint8_t bytes = (height + 7) / 8;

			uint8_t firstChar = ks0108FontRead(ks0108Font + GLCD_FONT_FIRST_CHAR);
			uint8_t charCount = ks0108FontRead(ks0108Font + GLCD_FONT_CHAR_COUNT);

			uint16_t index = 0;
			uint8_t x = ks0108Coord.x, y = ks0108Coord.y;

			if (c < firstChar || c >= (firstChar + charCount)) {
				return 1;
			}
			c -= firstChar;

			// read width data, to get the index
			for (uint8_t i = 0; i < c; i++) {
				index += ks0108FontRead(ks0108Font + GLCD_FONT_WIDTH_TABLE + i);
			}
			index = index * bytes + charCount + GLCD_FONT_WIDTH_TABLE;
			width = ks0108FontRead(ks0108Font + GLCD_FONT_WIDTH_TABLE + c);

			// last but not least, draw the character
			for (uint8_t i = 0; i < bytes; i++) {
				uint8_t page = i * width;
				for (uint8_t j = 0; j < width; j++) {
					uint8_t data = ks0108FontRead(ks0108Font + index + page + j);

					if (height < (i + 1) * 8) {
						data >>= (i + 1) * 8 - height;
					}

					if (ks0108FontColor == GLCD_BLACK) {
						GLCD_WriteData(data);
					} else {
						GLCD_WriteData(~data);
					}
				}
				// 1px gap between chars
				if (ks0108FontColor == GLCD_BLACK) {
					GLCD_WriteData(0x00);
				} else {
					GLCD_WriteData(0xFF);
				}
				GLCD_GotoXY(x, ks0108Coord.y + 8);
			}
			GLCD_GotoXY(x + width + 1, y);

