funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
			return 0;
		}

		void GLCD_Puts(char* str) {
			int x = ks0108Coord.x;
			while (*str != 0) {
				if (*str == '\n') {
					GLCD_GotoXY(x,
							ks0108Coord.y
							+ ks0108FontRead(ks0108Font + GLCD_FONT_HEIGHT));
				} else {
					GLCD_PutChar(*str);
				}
				str++;
			}
		}

		void GLCD_Puts_P(PGM_P str) {
			int x = ks0108Coord.x;
			while (pgm_read_byte(str) != 0) {
				if (pgm_read_byte(str) == '\n') {
					GLCD_GotoXY(x,
							ks0108Coord.y
							+ ks0108FontRead(ks0108Font + GLCD_FONT_HEIGHT));
				} else {
					GLCD_PutChar(pgm_read_byte(str));
				}
				str++;
			}
		}

		uint8_t GLCD_CharWidth(char c) {
			uint8_t width = 0;
			uint8_t firstChar = ks0108FontRead(ks0108Font + GLCD_FONT_FIRST_CHAR);
			uint8_t charCount = ks0108FontRead(ks0108Font + GLCD_FONT_CHAR_COUNT);

			// read width data
			if (c >= firstChar && c < (firstChar + charCount)) {
				c -= firstChar;
				width = ks0108FontRead(ks0108Font + GLCD_FONT_WIDTH_TABLE + c) + 1;
			}

			return width;
		}

		uint16_t GLCD_StringWidth(char* str) {
			uint16_t width = 0;

			while (*str != 0) {
				width += GLCD_CharWidth(*str++);
			}

			return width;
		}

		uint16_t GLCD_StringWidth_P(PGM_P str) {
			uint16_t width = 0;

			while (pgm_read_byte(str) != 0) {
				width += GLCD_CharWidth(pgm_read_byte(str++));
			}

			return width;
		}

		void GLCD_GotoXY(uint8_t x, uint8_t y) {
			uint8_t chip = GLCD_CHIP1, cmd;

			if (x > 127)
			x = 0; // ensure that coordinates are legal
			if (y > 63)
			y = 0;

			ks0108Coord.x = x;// save new coordinates
			ks0108Coord.y = y;
			ks0108Coord.page = y / 8;

			if (x >= 64) { // select the right chip
				x -= 64;
				chip = GLCD_CHIP2;
			}
			cmd = GLCD_SET_ADD | x;
			GLCD_WriteCommand(cmd, chip); // set x address on active chip

			cmd = GLCD_SET_PAGE | ks0108Coord.page;// set y address on both chips
			GLCD_WriteCommand(cmd, GLCD_CHIP1);
			GLCD_WriteCommand(cmd, GLCD_CHIP2);
		}

		void GLCD_Init(uint8_t invert) {
			ks0108Coord.x = 0;
			ks0108Coord.y = 0;
			ks0108Coord.page = 0;

			ks0108Inverted = invert;

			GLCD_CMD_DIR = 0xFF; // command port is output
			GLCD_WriteCommand(GLCD_ON, GLCD_CHIP1);// power on
			GLCD_WriteCommand(GLCD_ON, GLCD_CHIP2);

			GLCD_WriteCommand(GLCD_DISP_START, GLCD_CHIP1);// display start line = 0
			GLCD_WriteCommand(GLCD_DISP_START, GLCD_CHIP2);
			GLCD_ClearScreen();// display clear
			GLCD_GotoXY(0, 0);
		}

		inline void GLCD_Enable(void) {
			GLCD_CMD_PORT |= 0x01 << GLCD_EN; // EN high level width: min. 450ns
			asm volatile("nop\n\t"
					"nop\n\t"
					"nop\n\t"
					::);
			GLCD_CMD_PORT &= ~(0x01 << GLCD_EN);
			for (volatile uint8_t i = 0; i < 8; i++)
			;// a little delay loop (faster than reading the busy flag)
		}

		uint8_t GLCD_DoReadData(uint8_t first) {
			uint8_t data;
			volatile uint8_t i;

			GLCD_DATA_OUT = 0x00;
			GLCD_DATA_DIR = 0x00; // data port is input

			if (ks0108Coord.x < 64) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL2); // deselect chip 2
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL1;// select chip 1
			} else if (ks0108Coord.x >= 64) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL1); // deselect chip 1
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL2;// select chip 2
			}
			if (ks0108Coord.x == 64 && first) { // chip2 X-address = 0
				GLCD_WriteCommand(GLCD_SET_ADD, GLCD_CHIP2);// wuff wuff
			}

			GLCD_CMD_PORT |= 0x01 << GLCD_D_I; // D/I = 1
			GLCD_CMD_PORT |= 0x01 << GLCD_R_W;// R/W = 1

			GLCD_CMD_PORT |= 0x01 << GLCD_EN;// EN high level width: min. 450ns
			asm volatile("nop\n\t"
					"nop\n\t"
					"nop\n\t"
					::);

			data = GLCD_DATA_IN;// read Data

			GLCD_CMD_PORT &= ~(0x01 << GLCD_EN);
			for (i = 0; i < 8; i++)
			;// a little delay loop (faster than reading the busy flag)

			GLCD_DATA_DIR = 0xFF;

			GLCD_GotoXY(ks0108Coord.x, ks0108Coord.y);

			if (ks0108Inverted)
			data = ~data;
			return data;
		}

		inline uint8_t GLCD_ReadData(void) {
			GLCD_DoReadData(1); // dummy read
			return GLCD_DoReadData(0);// "real" read
		}

		void GLCD_WriteCommand(uint8_t cmd, uint8_t chip) {
			if (chip == GLCD_CHIP1) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL2); // deselect chip 2
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL1;// select chip 1
			} else if (chip == GLCD_CHIP2) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL1); // deselect chip 1
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL2;// select chip 2
			}

			GLCD_CMD_PORT &= ~(0x01 << GLCD_D_I); // D/I = 0
			GLCD_CMD_PORT &= ~(0x01 << GLCD_R_W);// R/W = 0
			GLCD_DATA_DIR = 0xFF;// data port is output
			GLCD_DATA_OUT = cmd;// write command
			GLCD_Enable();// enable
			GLCD_DATA_OUT = 0x00;
		}

		void GLCD_WriteData(uint8_t data) {
			uint8_t displayData, yOffset, cmdPort;

#ifdef DEBUG
			volatile uint16_t i;
			for(i=0; i<5000; i++);
#endif

			if (ks0108Coord.x >= 128)
			return;

			if (ks0108Coord.x < 64) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL2); // deselect chip 2
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL1;// select chip 1
			} else if (ks0108Coord.x >= 64) {
				GLCD_CMD_PORT &= ~(0x01 << GLCD_CSEL1); // deselect chip 1
				GLCD_CMD_PORT |= 0x01 << GLCD_CSEL2;// select chip 2
			}
			if (ks0108Coord.x == 64) // chip2 X-address = 0
			GLCD_WriteCommand(GLCD_SET_ADD, GLCD_CHIP2);

			GLCD_CMD_PORT |= 0x01 << GLCD_D_I;// D/I = 1
			GLCD_CMD_PORT &= ~(0x01 << GLCD_R_W);// R/W = 0
			GLCD_DATA_DIR = 0xFF;// data port is output

			yOffset = ks0108Coord.y % 8;
			if (yOffset != 0) {
				// first page
				cmdPort = GLCD_CMD_PORT;// save command port
				displayData = GLCD_ReadData();

				GLCD_CMD_PORT = cmdPort;// restore command port
				GLCD_DATA_DIR = 0xFF;// data port is output

				displayData |= data << yOffset;
				if (ks0108Inverted)
				displayData = ~displayData;
				GLCD_DATA_OUT = displayData;// write data
				GLCD_Enable();// enable

				// second page
				GLCD_GotoXY(ks0108Coord.x, ks0108Coord.y + 8);

				displayData = GLCD_ReadData();

				GLCD_CMD_PORT = cmdPort;// restore command port
				GLCD_DATA_DIR = 0xFF;// data port is output

				displayData |= data >> (8 - yOffset);
				if (ks0108Inverted)
				displayData = ~displayData;
				GLCD_DATA_OUT = displayData;// write data
				GLCD_Enable();// enable

				GLCD_GotoXY(ks0108Coord.x + 1, ks0108Coord.y - 8);
			} else {
				if (ks0108Inverted)
				data = ~data;
				GLCD_DATA_OUT = data; // write data
				GLCD_Enable();// enable
				ks0108Coord.x++;
			}
			GLCD_DATA_OUT = 0x00;
		}

#endif // ENABLE_GLCD
#ifdef ENABLE_7SEG
#ifdef SEG_COMMON_ANODE
		const uint8_t seg_mask = 0xff;
#else
		const uint8_t seg_mask = 0x00;
#endif

#ifdef SEG_DP_PORT
#define SEG_NR_CHARS 38
#else
#define SEG_NR_CHARS 37
#endif


		const uint8_t PROGMEM seg_code[SEG_NR_CHARS]= {
			// index 0 is character 0
			SEG_A+SEG_B+SEG_C+SEG_D+SEG_E+SEG_F,
			// index 1 is character 1
			SEG_B+SEG_C,
			// index 2 is character 2
			SEG_A+SEG_B+SEG_D+SEG_E+SEG_G,
			// index 3 is character 3
			SEG_A+SEG_B+SEG_C+SEG_D+SEG_G,
			// index 4 is character 4
			SEG_F+SEG_G+SEG_B+SEG_C,
			// index 5 is character 5
			SEG_A+SEG_C+SEG_D+SEG_F+SEG_G,
			// index 6 is character 6
			SEG_A+SEG_C+SEG_D+SEG_E+SEG_F+SEG_G,
			// index 7 is character 7
			SEG_A+SEG_B+SEG_C,
			// index 8 is character 8
			SEG_A+SEG_B+SEG_C+SEG_D+SEG_E+SEG_F+SEG_G,
			// index 9 is character 9
			SEG_A+SEG_B+SEG_C+SEG_D+SEG_F+SEG_G,
			// index 10 is character A
			SEG_A+SEG_B+SEG_C+SEG_E+SEG_F+SEG_G,
			// index 11 is character b
			SEG_C+SEG_D+SEG_E+SEG_F+SEG_G,
			// index 12 is character C
			SEG_A+SEG_D+SEG_E+SEG_F,
			// index 13 is character d
			SEG_B+SEG_C+SEG_D+SEG_E+SEG_G,
			// index 14 is character E
			SEG_A+SEG_D+SEG_E+SEG_F+SEG_G,
			// index 15 is character F
			SEG_A+SEG_E+SEG_F+SEG_G,
			// index 16 is character S
			SEG_A+SEG_F+SEG_G+SEG_C+SEG_D,
			// index 17 is character c
			SEG_G+SEG_E+SEG_D,
			// index 18 is character r
			SEG_G+SEG_E,
			// index 19 is character H
			SEG_F+SEG_E+SEG_G+SEG_B+SEG_C,
			// index 20 is character i
			SEG_C,
			// index 21 is character L
			SEG_F+SEG_E+SEG_D,
			// index 22 is character o
			SEG_G+SEG_C+SEG_D+SEG_E,
			// index 23 is character P
			SEG_A+SEG_B+SEG_G+SEG_F+SEG_E,
			// index 24 is character U
			SEG_F+SEG_E+SEG_D+SEG_C+SEG_B,
			// index 25 is character u
			SEG_E+SEG_D+SEG_C,
			// index 26 is character h
			SEG_F+SEG_E+SEG_G+SEG_C,
			// index 27 is character Y
			SEG_F+SEG_G+SEG_B+SEG_C+SEG_D,
			// index 28 is character J
			SEG_B+SEG_C+SEG_D,
			// index 29 is character N
			SEG_E+SEG_F+SEG_A+SEG_B+SEG_C,
			// index 30 is character n
			SEG_C+SEG_G+SEG_E,
			// index 31 is character T
			SEG_A+SEG_F+SEG_E,
			// index 32 is character = (equal)
			SEG_G+SEG_D,
			// index 33 is character - (minus)
			SEG_G,
			// index 34 is character _ (underline)
			SEG_D,
			// index 35 is character G
			SEG_A+SEG_C+SEG_D+SEG_E+SEG_F,
			// index 36 is character space
			0
#ifdef SEG_DP_PORT
			// index 37 is character DP (dot) only if you enabled it in atmegaclib.h header...
			// Otherwise, your array ends at index 36.
			, SEG_DP
#endif
		};
		void seg_init(void) {
#ifdef SEG_DIGITS_8
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
			SEG_DIGITS_BUFFER[3] = 36;
			SEG_DIGITS_BUFFER[4] = 36;
			SEG_DIGITS_BUFFER[5] = 36;
			SEG_DIGITS_BUFFER[6] = 36;
			SEG_DIGITS_BUFFER[7] = 36;

#elif  defined(SEG_DIGITS_7)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
			SEG_DIGITS_BUFFER[3] = 36;
			SEG_DIGITS_BUFFER[4] = 36;
			SEG_DIGITS_BUFFER[5] = 36;
			SEG_DIGITS_BUFFER[6] = 36;
#elif  defined(SEG_DIGITS_6)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
			SEG_DIGITS_BUFFER[3] = 36;
			SEG_DIGITS_BUFFER[4] = 36;
			SEG_DIGITS_BUFFER[5] = 36;
#elif  defined(SEG_DIGITS_5)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
			SEG_DIGITS_BUFFER[3] = 36;
			SEG_DIGITS_BUFFER[4] = 36;
#elif  defined(SEG_DIGITS_4)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
			SEG_DIGITS_BUFFER[3] = 36;
#elif  defined(SEG_DIGITS_3)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
			SEG_DIGITS_BUFFER[2] = 36;
#elif  defined(SEG_DIGITS_2)
			SEG_DIGITS_BUFFER[0] = 36;
			SEG_DIGITS_BUFFER[1] = 36;
#else
			SEG_DIGITS_BUFFER[0] = 36;
#endif
			// set direction for segment pins
#ifdef SEG_DP_DDR
			sbi(SEG_DP_DDR, SEG_DP_PIN);
#endif
			sbi(SEG_A_DDR, SEG_A_PIN);
			sbi(SEG_B_DDR, SEG_B_PIN);
			sbi(SEG_C_DDR, SEG_C_PIN);
			sbi(SEG_D_DDR, SEG_D_PIN);
			sbi(SEG_E_DDR, SEG_E_PIN);
			sbi(SEG_F_DDR, SEG_F_PIN);
			sbi(SEG_G_DDR, SEG_G_PIN);

			// set direction for common pins
#ifdef SEG_COMM_0_DDR
			sbi(SEG_COMM_0_DDR, SEG_COMM_0_PIN);
#endif
#ifdef SEG_COMM_1_DDR
			sbi(SEG_COMM_1_DDR, SEG_COMM_1_PIN);
#endif
#ifdef SEG_COMM_2_DDR
			sbi(SEG_COMM_2_DDR, SEG_COMM_2_PIN);
#endif
#ifdef SEG_COMM_3_DDR
			sbi(SEG_COMM_3_DDR, SEG_COMM_3_PIN);
#endif
#ifdef SEG_COMM_4_DDR
			sbi(SEG_COMM_4_DDR, SEG_COMM_4_PIN);
#endif
#ifdef SEG_COMM_5_DDR
			sbi(SEG_COMM_5_DDR, SEG_COMM_5_PIN);
#endif
#ifdef SEG_COMM_6_DDR
			sbi(SEG_COMM_6_DDR, SEG_COMM_6_PIN);
#endif
#ifdef SEG_COMM_7_DDR
			sbi(SEG_COMM_7_DDR, SEG_COMM_7_PIN);
#endif

