funlw65/atmega-clib/branches/ATmegaCLib2/atmegaclib2.c
		}

		uint8_t seg_digit_from_array(uint8_t index) {
			return seg_mask ^ pgm_read_byte(&seg_code[index]);
		}

		void seg_nibble(uint8_t segments) {
#ifdef SEG_DP_DDR
			cbi(SEG_DP_PORT, SEG_DP_PIN);
			if (bit_isset(segments,7))
			sbi(SEG_DP_PORT, SEG_DP_PIN);
#endif
			cbi(SEG_G_PORT, SEG_G_PIN);
			if (bit_isset(segments,6))
			sbi(SEG_G_PORT, SEG_G_PIN);
			cbi(SEG_F_PORT, SEG_F_PIN);
			if (bit_isset(segments,5))
			sbi(SEG_F_PORT, SEG_F_PIN);
			cbi(SEG_E_PORT, SEG_E_PIN);
			if (bit_isset(segments,4))
			sbi(SEG_E_PORT, SEG_E_PIN);
			cbi(SEG_D_PORT, SEG_D_PIN);
			if (bit_isset(segments,3))
			sbi(SEG_D_PORT, SEG_D_PIN);
			cbi(SEG_C_PORT, SEG_C_PIN);
			if (bit_isset(segments,2))
			sbi(SEG_C_PORT, SEG_C_PIN);
			cbi(SEG_B_PORT, SEG_B_PIN);
			if (bit_isset(segments,1))
			sbi(SEG_B_PORT, SEG_B_PIN);
			cbi(SEG_A_PORT, SEG_A_PIN);
			if (bit_isset(segments,0))
			sbi(SEG_A_PORT, SEG_A_PIN);
		}

		void seg_common_select(uint8_t digit) {
#ifdef SEG_COMM_7_PORT
			cbi(SEG_COMM_7_PORT,SEG_COMM_7_PIN);
			if(bit_isset(digit,7)) sbi(SEG_COMM_7_PORT,SEG_COMM_7_PIN);
#endif
#ifdef SEG_COMM_6_PORT
			cbi(SEG_COMM_6_PORT,SEG_COMM_6_PIN);
			if(bit_isset(digit,6)) sbi(SEG_COMM_6_PORT,SEG_COMM_6_PIN);
#endif
#ifdef SEG_COMM_5_PORT
			cbi(SEG_COMM_5_PORT,SEG_COMM_5_PIN);
			if(bit_isset(digit,5)) sbi(SEG_COMM_5_PORT,SEG_COMM_5_PIN);
#endif
#ifdef SEG_COMM_4_PORT
			cbi(SEG_COMM_4_PORT,SEG_COMM_4_PIN);
			if(bit_isset(digit,4)) sbi(SEG_COMM_4_PORT,SEG_COMM_4_PIN);
#endif
#ifdef SEG_COMM_3_PORT
			cbi(SEG_COMM_3_PORT, SEG_COMM_3_PIN);
			if (bit_isset(digit,3))
			sbi(SEG_COMM_3_PORT, SEG_COMM_3_PIN);
#endif
#ifdef SEG_COMM_2_PORT
			cbi(SEG_COMM_2_PORT, SEG_COMM_2_PIN);
			if (bit_isset(digit,2))
			sbi(SEG_COMM_2_PORT, SEG_COMM_2_PIN);
#endif
#ifdef SEG_COMM_1_PORT
			cbi(SEG_COMM_1_PORT, SEG_COMM_1_PIN);
			if (bit_isset(digit,1))
			sbi(SEG_COMM_1_PORT, SEG_COMM_1_PIN);
#endif
			// At least one pin must be set for selecting the digit
			// (minimum 1 digit, maximum 8 digits)
			cbi(SEG_COMM_0_PORT, SEG_COMM_0_PIN);
			if (bit_isset(digit,0))
			sbi(SEG_COMM_0_PORT, SEG_COMM_0_PIN);
		}

// Usage if common pin is active in 0 logic and you want to select the digit nr.4:
// seg_select_digit(SELECT_DIGIT_FOUR, 0);
		void seg_select_digit(MyDigit digit, uint8_t active_logic) {
			uint8_t digit_mask;
			if (active_logic == 0)
			digit_mask = 0xFF;
			else
			digit_mask = 0x00;
			seg_common_select(digit_mask ^ digit);
		}

#endif

#ifdef ENABLE_I2C_SOFTWARE
		uint8_t I2C_write(uint8_t b) {
			uint8_t i;
			I2C_SDA_WR();
			for (i = 0; i < 8; i++) {
				if (b & 0x80)
				I2C_SDA_H();
				else
				I2C_SDA_L();
				_delay_us(10);
				I2C_SCL_H();
				_delay_us(10);
				I2C_SCL_L();
				b <<= 1;
			}
			I2C_SDA_RD();
			I2C_SDA_H();
			_delay_us(10);
			I2C_SCL_H();
			_delay_us(10);
			i = 0xFF;
			do {
				if (bit_is_clear(I2C_PORT_I,I2C_SDA))
				break;
				_delay_us(10);
			}while (--i > 0);
			I2C_SCL_L();
			_delay_us(10);
			return (i);
		}

		uint8_t I2C_read(uint8_t ack) {
			uint8_t i;
			uint8_t b = 0;
			I2C_SDA_RD();
			I2C_SDA_H();
			_delay_us(10);
			for (i = 0; i < 8; i++) {
				I2C_SCL_H();
				_delay_us(10);
				b <<= 1;
				if (bit_is_set(I2C_PORT_I,I2C_SDA))
				b |= 1;
				I2C_SCL_L();
				_delay_us(10);
			}
			I2C_SDA_WR();
			if (ack == 0)
			I2C_SDA_L();
			else
			I2C_SDA_H();
			_delay_us(10);
			I2C_SCL_H();
			_delay_us(10);
			I2C_SCL_L();
			_delay_us(10);
			I2C_SDA_L();
			_delay_us(10);
			return (b);
		}

		void I2C_start(void) {
			I2C_SCL_H();
			I2C_SDA_H();
			I2C_SDA_WR();
			I2C_SCL_WR();
			_delay_us(10);
			I2C_SDA_L();
			_delay_us(10);
			I2C_SCL_L();
			_delay_us(10);
		}

		void I2C_stop(void) {
			I2C_SDA_WR(); // SDA na zapis
			I2C_SCL_H();
			_delay_us(10);
			I2C_SDA_H();
			_delay_us(10);
		}
#endif // end I2C software
#ifdef ENABLE_TWI

#define  TWI_START            0x08
#define  TWI_REP_START        0x10
#define  TWI_MT_SLA_ACK       0x18
#define  TWI_MT_SLA_NACK      0x20
#define  TWI_MT_DATA_ACK      0x28
#define  TWI_MT_DATA_NACK     0x30
#define  TWI_MR_SLA_ACK       0x40
#define  TWI_MR_SLA_NACK      0x48
#define  TWI_MR_DATA_ACK      0x50
#define  TWI_MR_DATA_NACK     0x58
#define  TWI_ARB_LOST         0x38

#define  TWI_ERROR_CODE   0x7e

		void TWI_init(void) {
			TWCR = 0x00; //disable twi
#if defined(TWPS0)
			TWSR = 0;
#endif
			TWBR = (F_CPU / TWI_FREQ - 16) / 2;

			// enable twi module, acks, and twi interrupt
			//TWCR = _BV(TWEN) | _BV(TWIE) | _BV(TWEA);
		}

//*************************************************
//Function to start i2c communication
//*************************************************
		uint8_t TWI_start(void) {
			TWCR = (1 << TWINT) | (1 << TWSTA) | (1 << TWEN); //Send START condition
			//Wait for TWINT flag set. This indicates that the
			//  START condition has been transmitted
			while (!(TWCR & (1 << TWINT)))
			;
			//Check value of TWI Status Register
			if ((TWSR & 0xF8) == TWI_START)
			return (0);
			else
			return (1);
		}

//*************************************************
//Function for repeat start condition
//*************************************************
		uint8_t TWI_repeatStart(void) {
			TWCR = (1 << TWINT) | (1 << TWSTA) | (1 << TWEN); //Send START condition
			//Wait for TWINT flag set. This indicates that the
			while (!(TWCR & (1 << TWINT)))
			;
			//START condition has been transmitted
			//Check value of TWI Status Register
			if ((TWSR & 0xF8) == TWI_REP_START)
			return (0);
			else
			return (1);
		}

//**************************************************
//Function to transmit address of the slave
//*************************************************
		uint8_t TWI_sendAddress(uint8_t address) {
			uint8_t STATUS;

			if ((address & 0x01) == 0)
			STATUS = TWI_MT_SLA_ACK;
			else
			STATUS = TWI_MR_SLA_ACK;

			TWDR = address;
			//Load SLA_W into TWDR Register. Clear TWINT bit
			//in TWCR to start transmission of address
			TWCR = (1 << TWINT) | (1 << TWEN);
			//Wait for TWINT flag set. This indicates that the SLA+W has been transmitted,
			// and ACK/NACK has been received.
			while (!(TWCR & (1 << TWINT)))
			;
			//Check value of TWI Status Register
			if ((TWSR & 0xF8) == STATUS)
			return (0);
			else
			return (1);
		}

